#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Tue Mar 12 15:38:59 CET 2013
ChannelList.error.1=\u03A3\u03C6\u03B1\u03BB\u03BC\u03B1 \u03C3\u03C4\u03B7\u03BD \u03B1\u03BD\u03B1\u03B3\u03BD\u03C9\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B9\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD\!\n({0})
ChannelList.error.2=\u03A3\u03C6\u03B1\u03BB\u03BC\u03B1 \u03C3\u03C4\u03B7\u03BD \u03B1\u03C0\u03BF\u03B8\u03B7\u03BA\u03B5\u03C5\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B9\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD\!\n({0})
DataService.connecting=\u03A3\u03C5\u03BD\u03B4\u03AD\u03B5\u03C4\u03B1\u03B9...
DataService.error.1=\u03A3\u03C6\u03AC\u03BB\u03BC\u03B1 \u03BA\u03B1\u03C4\u03AC \u03C4\u03B7\u03BD \u03B1\u03BD\u03AC\u03B3\u03BD\u03C9\u03C3\u03B7 \u03C4\u03BF\u03C5 \u03C0\u03C1\u03BF\u03B3\u03C1\u03AC\u03BC\u03BC\u03B1\u03C4\u03BF\u03C2 \u03B1\u03C0\u03BF {0} \u03C3\u03B5 {1}\!\n({2})
DataService.error.2=\u03A3\u03C6\u03B1\u03BB\u03BC\u03B1 \u03C3\u03C4\u03B7\u03BD \u03B1\u03C0\u03BF\u03B8\u03B7\u03BA\u03B5\u03C5\u03C3\u03B7 \u03C4\u03BF\u03C5 \u03C0\u03C1\u03BF\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03BF\u03C2 \u03B1\u03C0\u03BF {0} \u03C3\u03B5 {1}\!\n({2})
DataService.error.3=\u0397 \u03B5\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B9\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD \u03B1\u03C0\u03B5\u03C4\u03C5\u03C7\u03B5\!\n({0})
DataService.error.4=\u0397 \u03B5\u03BE\u03B1\u03B3\u03C9\u03B3\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B9\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD \u03B1\u03C0\u03B5\u03C4\u03C5\u03C7\u03B5\!\n({0})
DataService.error.5=\u0397 \u03BB\u03C5\u03C8\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B9\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD \u03B1\u03C0\u03B5\u03C4\u03C5\u03C7\u03B5\!
Settings.settingBroken=\u03A4\u03BF \u03B1\u03C1\u03C7\u03B5\u03AF\u03BF \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03C9\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 \u03C3\u03C0\u03B1\u03C3\u03BC\u03AD\u03BD\u03BF. \u0398\u03B1 \u03B8\u03AD\u03BB\u03B1\u03C4\u03B5 \u03BD\u03B1 \u03C6\u03BF\u03C1\u03C4\u03CE\u03C3\u03B5\u03B9 \u03C4\u03BF \u03B1\u03C1\u03C7\u03B5\u03AF\u03BF \u03B1\u03BD\u03C4\u03B9\u03B3\u03C1\u03AC\u03C6\u03BF\u03C5 \u03B1\u03C3\u03C6\u03B1\u03BB\u03B5\u03AF\u03B1\u03C2? \u0391\u03BD \u03B5\u03C0\u03B9\u03BB\u03AD\u03BE\u03B5\u03C4\u03B5 \u03CC\u03C7\u03B9, \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03BF\u03CD\u03BD\u03C4\u03B1\u03B9 \u03BF\u03B9 \u03C0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03B5\u03B3\u03BC\u03AD\u03BD\u03B5\u03C2 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2.\n
TvDataUpdater.afterUpdateInfo=\u03A0\u03BB\u03B7\u03C1\u03BF\u03C6\u03BF\u03C1\u03B9\u03B5\u03C2 \u03C4\u03BF\u03C5 update \u03B4\u03B5\u03B4\u03BF\u03BC\u03B5\u03BD\u03C9\u03BD
TvDataUpdater.calculateEntries=\u03A5\u03C0\u03BF\u03BB\u03BF\u03B3\u03B9\u03C3\u03BC\u03CC\u03C2 \u03BD\u03AD\u03C9\u03BD \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03AE\u03C3\u03B5\u03C9\u03BD \u03C3\u03C4\u03B7\u03BD \u03B2\u03AC\u03C3\u03B7 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD 
TvDataUpdater.downloadFailed=\u03A4\u03BF TV-Browser \u03B4\u03B5\u03BD \u03B8\u03B1 \u03BC\u03C0\u03BF\u03C1\u03B5\u03C3\u03B5 \u03BD\u03B1 \u03BA\u03B1\u03BD\u03B5\u03B9 \u03BA\u03B1\u03BC\u03BC\u03B9\u03B1 \u03BB\u03AE\u03C8\u03B7 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03C9\u03BD. \u039F \u03B5\u03BB\u03B5\u03B3\u03C7\u03BF\u03C2 \u03BC\u03B5 \u03AD\u03BD\u03B1\u03BD \u03B4\u03B9\u03B1\u03BA\u03BF\u03BC\u03B9\u03C3\u03C4\u03AE \u03CE\u03C1\u03B1\u03C2 \u03C4\u03BF\u03C5 \u0394\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF\u03C5 \u03AD\u03B4\u03B5\u03B9\u03BE\u03B5 \u03CC\u03C4\u03B9 \u03B7 \u03CE\u03C1\u03B1 \u03C4\u03BF\u03C5 \u03C4\u03BF\u03C0\u03B9\u03BA\u03BF\u03CD \u03C5\u03C0\u03BF\u03BB\u03BF\u03B3\u03B9\u03C3\u03C4\u03AE \u03B4\u03B9\u03B1\u03C6\u03AD\u03C1\u03B5\u03B9 \u03C0\u03B5\u03C1\u03B9\u03C3\u03C3\u03CC\u03C4\u03B5\u03C1\u03BF \u03B1\u03C0\u03CC \u03BC\u03B9\u03B1 \u03B7\u03BC\u03AD\u03C1\u03B1 \u03B1\u03C0\u03CC \u03C4\u03B7\u03BD \u03B5\u03C0\u03AF\u03C3\u03B7\u03BC\u03B7 \u03CE\u03C1\u03B1. \u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03BB\u03CE \u03B5\u03BB\u03AD\u03B3\u03BE\u03C4\u03B5 \u03C4\u03B9\u03C2 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 \u03B7\u03BC\u03B5\u03C1\u03BF\u03BC\u03B7\u03BD\u03AF\u03B1\u03C2 \u03BA\u03B1\u03B9 \u03CE\u03C1\u03B1\u03C2 \u03C4\u03BF\u03C5 \u03C5\u03C0\u03BF\u03BB\u03BF\u03B3\u03B9\u03C3\u03C4\u03AE \u03C3\u03B1\u03C2.\n\n\u0397 \u03B7\u03BC\u03B5\u03C1\u03BF\u03BC\u03B7\u03BD\u03B9\u03B1 \u03BA\u03B1\u03B9 \u03B7 \u03C9\u03C1\u03B1 \u03C3\u03B1\u03C2\: {0}\n\u0397 \u03B7\u03BC\u03B5\u03C1\u03BF\u03BC\u03B7\u03BD\u03B9\u03B1 \u03BA\u03B1\u03B9 \u03B7 \u03C9\u03C1\u03B1 \u03C3\u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF\: {1}
TvDataUpdater.error.1=\u0397 \u03C3\u03C5\u03BD\u03B5\u03C7\u03B7\u03C2 \u03BB\u03C5\u03C8\u03B7 \u03C4\u03BF\u03C5 \u03C0\u03C1\u03BF\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03BF\u03C2 \u03B1\u03C0\u03B5\u03C4\u03C5\u03C7\u03B5
TvDataUpdater.noConnectionMessage=\u03A4\u03BF TV-Browser \u03C0\u03C1\u03BF\u03C3\u03C0\u03AC\u03B8\u03B7\u03C3\u03B5 \u03BD\u03B1 \u03BA\u03B1\u03C4\u03B5\u03B2\u03AC\u03C3\u03B5\u03B9 \u03C4\u03B9\u03C2 \u03BB\u03AF\u03C3\u03C4\u03B5\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD. \u0394\u03B5\u03BD \u03BC\u03C0\u03CC\u03C1\u03B5\u03C3\u03B5 \u03BD\u03B1 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AE\u03B8\u03B5\u03B9 \u03BC\u03B9\u03B1 \u03C3\u03CD\u03BD\u03B4\u03B5\u03C3\u03B7 \u03C3\u03C4\u03BF \u0394\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF. \u039E\u03B1\u03BD\u03B1\u03C0\u03C1\u03BF\u03C3\u03C0\u03B1\u03B8\u03AE\u03C3\u03C4\u03B5 \u03B1\u03C6\u03BF\u03CD \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AE\u03C3\u03B5\u03C4\u03B5 \u03BC\u03B9\u03B1 \u03C3\u03CD\u03BD\u03B4\u03B5\u03C3\u03B7 \u03C3\u03C4\u03BF \u0394\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF.\n
TvDataUpdater.noConnectionTitle=\u0397 \u03C3\u03C5\u03BD\u03B4\u03B5\u03C3\u03B7 \u03B1\u03C0\u03B5\u03C4\u03C5\u03C7\u03B5\!
TvDataUpdater.timezone=\u03A4\u03BF TV-Browser \u03B5\u03BB\u03B5\u03B3\u03BE\u03B5 \u03BF\u03C1\u03B9\u03C3\u03BC\u03AD\u03BD\u03B1 \u03B1\u03C0\u03CC \u03C4\u03B1 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03B1 \u03B4\u03B9\u03B1\u03B8\u03AD\u03C3\u03B9\u03BC\u03C9\u03BD \u03C0\u03C1\u03CC\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03C9\u03BD \u03BA\u03B1\u03B9 \u03B4\u03B9\u03B1\u03C0\u03B9\u03C3\u03C4\u03CE\u03B8\u03B7\u03BA\u03B5 \u03CC\u03C4\u03B9 \u03B7 \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03AE \u03B1\u03C6\u03B5\u03C4\u03B7\u03C1\u03AF\u03B1 \u03B4\u03B5\u03BD \u03C4\u03B1\u03B9\u03C1\u03B9\u03AC\u03B6\u03B5\u03B9 \u03BC\u03B5 \u03C4\u03B7\u03BD \u03B1\u03BD\u03B1\u03BC\u03B5\u03BD\u03CC\u03BC\u03B5\u03BD\u03B7 \u03CE\u03C1\u03B1 \u03AD\u03BD\u03B1\u03C1\u03BE\u03B7\u03C2. \u039A\u03AC\u03C0\u03BF\u03B9\u03B5\u03C2 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 \u03C4\u03B7\u03C2 \u03C9\u03C1\u03BF\u03BB\u03BF\u03B3\u03B9\u03B1\u03BA\u03B7\u03C2 \u03B6\u03C9\u03BD\u03B7\u03C2 \u03B5\u03B9\u03BD\u03B1\u03B9 \u03BB\u03AC\u03B8\u03BF\u03C2. \u0393\u03B9\u03B1 \u03BD\u03B1 \u03B4\u03B9\u03BF\u03C1\u03B8\u03CE\u03C3\u03B5\u03C4\u03B5 \u03B1\u03C5\u03C4\u03CC, \u03C0\u03B1\u03C1\u03B1\u03BA\u03B1\u03BB\u03BF\u03CD\u03BC\u03B5 \u03B5\u03C0\u03B9\u03C3\u03BA\u03B5\u03C6\u03B8\u03B5\u03B9\u03C4\u03B5 \u03C4\u03B7\u03BD \u03B9\u03C3\u03C4\u03BF\u03C3\u03B5\u03BB\u03B9\u03B4\u03B1 http\://enwiki.tvbrowser.org/index.php/FAQ\n
