<html>
<head>
<link rel="stylesheet" type="text/css" href="../style.css">

</head>

<body style="font-family : Verdana, Arial, Sans-serif">
               
<h1>FAQ - H&auml;ufig gestellte Fragen</h1>

<h2>1. Allgemein</h2>

      
         <ul>
         <li><a href="#1_1">Was ist TV-Browser?</a></li>
         <li><a href="#1_2">Auf welchen Systemen l&auml;uft TV-Browser?</a></li>
         <li><a href="#1_3">Welche Sender werden in TV-Browser dargestellt?</a></li>
         <li><a href="#1_4">Warum ist TV-Browser kostenlos?</a></li>
         <li><a href="#1_5">Was unterscheidet TV-Browser von &auml;hnlichen, aber kostenpflichtigen Diensten?</a></li>
         <li><a href="#1_6">Unterst&uuml;tzt TV-Browser auch Radiosender?</a></li>
         </ul>

<h2>2. Probleme</h2>
        
         <ul>  
         <li><a href="#2_1">Wie kann ich TV-Browser starten?</a></li>
         <li><a href="#2_2">Habe ich die richtige Java-Version installiert?</a></li>
         <li><a href="#2_3">Beim Starten von TV-Browser erhalte ich die Fehlermeldung <em>"Could not find main class"</em></a></li>
         <li><a href="#2_4">Beim Starten von TV-Browser &ouml;ffnet sich mein Pack-Programm.</a></li>
         <li><a href="#2_5">Wenn ich TV-Browser starte erhalte ich die Meldung <em>"Bitte starten Sie TV-Browser im TV-Browser-Verzeichnis"</em>. Was bedeutet das?</a></li>
         <li><a href="#2_6">TV-Browser aktualisiert nicht.</a></li>
         <li><a href="#2_7">Die Beginnzeiten der Sendungen stimmen um eine Stunde nicht. Was ist da los?</a></li>
         <li><a href="#2_8">TV-Browser zeigt keine Bilder zu den Sendungen an. Warum nicht?</a></li>


         </ul>
         
<h2>3. Tipps</h2>
         
         <ul>
         <li><a href="#3_1">Ich habe zwei Betriebssysteme installiert und m&ouml;chte auf beiden Systemen die selben Einstellungen verwenden. Geht das?</a></li>
         <li><a href="#3_2">Ich w&uuml;rde gerne eine Verkn&uuml;pfung zum TV-Browser auf meinem Linux-Desktop erstellen. Wie geht das?</a></li>
         </ul>
         
<h2>4. Sonstige Fragen</h2>
    
         <ul>
         <li><a href="#4_1">Wie funktioniert die Aktualisierung genau?</a></li>
         <li><a href="#4_2">Ist es m&ouml;glich, die TV-Browser-Programmdaten in z.B. das XMLTV-Format zu konvertieren und kostenlos zu verteilen?</a></li>
         <li><a href="#4_3">Warum nicht?</a></li>
         <li><a href="#4_4">Darf ich die TV-Daten f&uuml;r eigene Zwecke verwenden?</a></li>
         <li><a href="#4_5">Woher stammen die TV-Browser Programmdaten eigentlich?</a></li>
         <li><a href="#4_6">Das entsprechende Programmmodul ist anscheinend Closed Source. Warum?</a></li>
        
         <li><a href="#4_7">Ich habe noch eine Frage, die hier nicht beantwortet worden ist.</a></li>

         </ul>


<p style="padding-top:30px">
</p>

<h2>1. Allgemein</h2>

         <h3>
            <a name="1_1"></a>Was ist TV-Browser?
         </h3>
         <p>
         TV-Browser ist eine digitale TV-Zeitschrift. Das hei&szlig;t, mit TV-Browser l&auml;&szlig;t sich das aktuelle TV-Programm aus dem Internet herunterladen. Die Daten k&ouml;nnen dann offline - also ohne bestehende Internetverbindung - betrachtet werden. 
         </p>

         <h3>
            <a name="1_2"></a>Auf welchen Systemen l&auml;uft TV-Browser?
         </h3>
         <p>
         TV-Browser l&auml;uft auf allen Systemen, f&uuml;r die es die Java-Laufzeitumgebung gibt.<br />
         Dies ist in der Regel bei jedem Desktop-System der Fall.
         Die  <a href="http://java.sun.com/getjava/index.html" target="_blank">Java-Laufzeitumgebung 1.4</a> mu&szlig; also installiert sein.
         </p>

         <h3>
            <a name="1_3"></a>Welche Sender werden in TV-Browser dargestellt?
         </h3>
         <p>
         Die <a href="http://tvbrowser.sourceforge.net/channels.html"  target="_blank">Liste der Sender</a> ist auf der Website verf&uuml;gbar.<br />
         Das Senderangebot wird laufend erweitert. 
         </p>

         <h3>
            <a name="1_4"></a>Warum ist TV-Browser kostenlos?
         </h3>
         <p>
         Die TV-Daten werden uns kostenlos zur Verf&uuml;gung gestellt. Die Server, von denen TV-Browser die Daten l&auml;dt, sind von Usern, die uns damit unterst&uuml;tzen.<br />
Wir arbeiten einfach gerne an diesem Projekt.
         </p>

         <h3>
            <a name="1_5"></a>Was unterscheidet TV-Browser von &auml;hnlichen, aber kostenpflichtigen Diensten?
         </h3>
         <p>
         Kostenpflichtige Dienste setzen professionelle Redaktionen ein, die die Programmdaten aufbereiten oder kaufen bereits aufbereitete Daten ein. Das ist entsprechend teuer.<br />
Bei uns erfolgt diese Aufbereitung maschinell. D.h. wir m&uuml;ssen nur unsere Programme, die die Daten aufbereiten, betreuen und verbessern. 
         </p>

         <h3>
            <a name="1_6"></a>Unterst&uuml;tzt TV-Browser auch Radiosender?
         </h3>
         <p>
         Wir haben derzeit ein paar wenige Radiosender in unserem Angebot. Evtl. kommen weitere dazu.
         </p>



<h2>2. Probleme</h2>
         <h3>
            <a name="2_1"></a>Wie kann ich TV-Browser starten?
         </h3>
         <p>
       Auf Windows-Systemen mu&szlig; die Datei "tvbrowser.exe" oder "tvbrowser.jar" doppelgeklickt werden.<br />
In der Konsole wird TV-Browser mit</p><pre> java -jar tvbrowser.jar</pre><p> gestartet. Vorher mu&szlig; in das entsprechende Verzeichnis gewechselt werden.
         </p>


         <h3>
            <a name="2_2"></a>Habe ich die richtige Java-Version installiert?
         </h3>
         <p>
Gibt man an der Konsole (Windows: DOS-Box, Eingabeaufforderung) 
         </p><pre>java -version</pre><p>
         ein, so sollte das ungef&auml;hr so aussehen:
         </p><pre>
java version "1.4.1_01"
Java(TM) 2 Runtime Environment, Standard Edition
(build 1.4.1_01-b01)
Java HotSpot(TM) Client VM (build 1.4.1_01-b01,
mixed mode)
</pre><p>
         Erscheint eine niedrigere Versionsnummer als 1.4 oder gar eine Fehlermeldung, so mu&szlig; Java noch installiert werden. 
         <a href=" http://java.sun.com/getjava/index.html" target="_blank">Download</a>
         </p>


         <h3>
            <a name="2_3"></a>Beim Starten von TV-Browser erhalte ich die Fehlermeldung <em>"Could not find main class"</em>
         </h3>
         <p>
TV-Browser mu&szlig; mit </p><pre>java -jar tvbrowser.jar</pre><p> gestartet werden.
         </p>
         <p>
         <strong>MS-Windows: </strong>Im Explorer, Men&uuml; <em>Extras</em> - <em>Ordneroptionen</em> --> Dateitypen <em>JAR</em> auf <em>erweitert</em> klicken. Dem Vorgang <em>open</em> (auf <em>bearbeiten</em> klicken) sollte ungef&auml;hr das hier zugeordnet sein: "C:\Programme\Java\j2re1.4.0\bin\javaw.exe"<strong> -jar</strong> "%1"
         </p>


         <h3>
            <a name="2_4"></a>Beim Starten von TV-Browser &ouml;ffnet sich mein Pack-Programm.
         </h3>
         <p>
Bei der Installation von Java, werden jar-Dateien der Java VM zugeordnet. Wenn sich tvbrowser.jar per Doppelklick (MS Windows) nicht &ouml;ffnen l&auml;&szlig;t, hat wahrscheinlich das Packprogramm diese Zuordnung &uuml;berschrieben. 
         siehe: <a href="#2_3">"Beim Starten von TV-Browser erhalte ich die Fehlermeldung <em>"Could not find main class</em>"</a>

         </p>



         <h3>
            <a name="2_5"></a>Wenn ich TV-Browser starte erhalte ich die Meldung <em>"Bitte starten Sie TV-Browser im TV-Browser-Verzeichnis"</em>. Was bedeutet das?
         </h3>
         <p>
         TV-Browser mu&szlig; so gestartet werden: </p><pre>java -jar tvbrowser.jar</pre> <p>Dabei darf kein Pfad zu <em>tvbrowser.jar</em> angegeben werden. Mit dem Kommando <em>cd</em> mu&szlig also vorher in das Verzeichnis in dem tvbrowser.jar liegt, gewechselt werden.
         </p>



         <h3>
            <a name="2_6"></a>TV-Browser aktualisiert nicht
         </h3>
         <p>
         F&uuml;r die Aktualisierung ist eine Internetverbindung notwendig.<br />
         &Uuml;berpr&uuml;fen Sie also, ob TV-Browser Zugang zum Internet hat.
         </p>



         <h3>
            <a name="2_7"></a>Die Beginnzeiten der Sendungen stimmen um eine Stunde nicht. Was ist da los?
         </h3>
         <p>
         TV-Browser beachtet bei der Anzeige der Programmdaten den Standort (Zeitzone) von Fernsehsender und Benutzer. Auf diese Weise kann TV-Browser auch Programme von Sendern, die sich in einer anderen Zeitzone befinden, korrekt darstellen.<br />
&Uuml;berpr&uuml;fen Sie also die Zeitzone Ihres Systems.
         </p>

<h3>
            <a name="2_8"></a>TV-Browser zeigt keine Bilder zu den Sendungen an. Warum nicht?
         </h3>
         <p>
         TV-Browser kann derzeit keine Bilder darstellen. In einer sp&auml;teren Version wird dies eventuell m&ouml;glich sein.
         </p>


<h2>3. Tipps</h2>


         <h3>
            <a name="3_1"></a>Ich habe zwei Betriebssysteme installiert und m&ouml;chte auf beiden Systemen die selben Einstellungen verwenden. Geht das?
         </h3>
         <p>
         Ja. TV-Browser speichert die Einstellungen im Homeverzeichnis des Systems. Dort wird ein Verzeichnis mit dem Namen <em>.tvbrowser</em> erzeugt.<br />
Startet man TV-Browser so (Gro&szlig;- /Kleinschreibung beachten):</p><pre>java -Duser.home=/EINSTELLUNGEN -jar tvbrowser.jar</pre><p>
so wird das <em>.tvbrowser</em>-Verzeichnis im angegebenen Verzeichnis erzeugt bzw. verwendet.<br />
Auf diese Weise k&ouml;nnen sich zwei TV-Browser-Installationen auf verschiedenen Systemen die Einstellungen teilen.
         </p>



<h3>
            <a name="3_2"></a>Ich w&uuml;rde gerne eine Verkn&uuml;pfung zum TV-Browser auf meinem Linux-Desktop erstellen. Wie geht das?
         </h3>
         <p>
         Starte TV-Browser mit einem Shell-Script:<br />Zum Beispiel:
         </p><pre>#!/bin/bash
cd $HOME/tvbrowser
java -jar tvbrowser.jar</pre><p>
Wichtig ist, da&szlig; vor dem Start von TV-Browser in das richtige Verzeichnis gewechselt wird. Der Aufruf <em>java -jar $HOME/tvbrowser/tvbrowser.jar</em> funktioniert also nicht!
         </p>


<h2>4. Sonstige Fragen</h2>
        <h3>
            <a name="4_1"></a>Wie funktioniert die Aktualisierung genau?
         </h3>
         <p>
         Die TV-Daten werden mittels Plugins, sogenannten <em>TVDataServices</em> heruntergeladen. Ein solches TVDataService l&auml;dt die TV-Daten (&uuml;blicherweise) aus dem Internet und &uuml;bergibt sie an TV-Browser, der sie dann darstellt und speichert (Im Verzeichnis <em>tvdataservice/</em> befinden sich diese Plugins in Form von .jar-Dateien).<br />
Es existiert kein einheitliches Protokoll oder Format, mit dem die TV-Daten &uuml;bertragen werden.<br />
Seit Version 0.9.7 bieten wir eigene TV-Daten an. Auch hier verwenden wir ein         <em>TVDataService</em>, das den Programmdaten-Download durchf&uuml;hrt. Auf diese Weise k&ouml;nnen nach wie vor eigene DataServices entwickelt und verwendet werden.<br />
</p>

<h3>
            <a name="4_2"></a>Ist es m&ouml;glich, die TV-Browser-Programmdaten in z.B. das XMLTV-Format zu konvertieren und kostenlos zu verteilen?
         </h3>
         <p>
        Nein.
         </p>

<h3>
            <a name="4_3"></a>Warum nicht?
         </h3>
         <p>
         Wir d&uuml;rfen das nicht. Wir haben nicht die notwendigen Rechte, um die TV-Daten anderen zur Weiterverbreitung zu &uuml;berlassen.
         </p>

         <h3>
         <a name="4_4"></a>Darf ich die TV-Daten f&uuml;r eigene Zwecke verwenden?
         </h3>
         <p>
         Die Daten d&uuml;rfen nur mit TV-Browser verwendet werden. Es ist nicht erlaubt, 
Programme anzubieten, die unsere TV-Daten - auf welche Weise auch immer - verwenden.<br />Auch d&uuml;rfen die TV-Daten nicht weiterverbreitet werden.<br />
         </p>

<h3>
            <a name="4_5"></a>Woher stammen die TV-Browser Programmdaten eigentlich?
         </h3>
         <p>
        Die Daten stammen von den Pressestellen der Sender. Die genauen Quellen sind auf unserer <a href="http://tvbrowser.sourceforge.net/channels.html" target="_blank">Website</a> zu finden.
         </p>

<h3>
            <a name="4_6"></a>Das entsprechende Programmmodul ist anscheinend Closed Source. Warum?
         </h3>
         <p>
        Der Closed-Source-Anteil ist auf wenige Code-Teile beschr&auml;nkt. Einzig das Daten-einsammeln ist nicht Open Source. Die Sender<a href="#footnote">*</a> haben <strong>mir</strong> Zugang zu den Daten gegeben (nachdem sie gepr&uuml;ft haben, was ich damit machen will); d.h. sie wollen offenbar wissen, <strong>wer</strong> mit den Daten <strong>was</strong> macht.<br />

         </p>
<h3>
<a name="4_7"></a>Ich habe noch eine Frage, die hier nicht beantwortet worden ist.</a>
</h3>
<p>
Bitte lesen Sie die FAQ auf der <a href="http://tvbrowser.sourceforge.net" target=_blank">TV-Browser-Website</a>. Sollten Sie auch dort nicht f&uuml;ndig werden, so werden Ihre Fragen gerne im <a href="http://tvbrowser.sourceforge.net/forum.html" target="_blank">TV-Browser-Forum</a> beantwortet.
</p>


<p>
<a name="footnote"></a>
<em>* Mit Sender sind hier die Verantwortlichen bei den jeweiligen Pressestellen gemeint.</em>

</p>

 </body>
</html>