<html>
<head>
<link rel="stylesheet" type="text/css" href="../style.css">
</head>

<body style="font-family : Verdana, Arial, Sans-serif">

<h1>Einstellungen</h1>

<p>
TV-Browser bietet zahlreiche Einstellungsm&ouml;glichkeiten. Die wichtigsten sollen hier erkl&auml;rt werden.
</p>

<p>
<img src="img03.png" width="166" height="118"></img>
</p>

<p>
Dr&uuml;cken Sie die Tastenkombination <em>Strg-S</em> oder w&auml;hlen Sie <em>Einstellungen</em> aus dem Men&uuml; <em>TV-Browser</em> um den Einstellungen-Dialog zu &ouml;ffnen.
</p>

<a name="channels"></a>
<h2>Kan&auml;le</h2>

<img src="img02.png" width="547" height="443"></img>

<p>
Selektieren Sie auf der linken Seite jene Kan&auml;le, die TV-Browser in der Tabelle darstellen soll und klicken Sie anschlie&szlig;end auf den <img src="Forward24.gif" width="24" height="24"></img>-Knopf. Die markierten Kan&auml;le stehen dann in der Programmtabelle zur Verf&uuml;gung.
</p>

<h3>Senderliste aktualisieren</h3>
<p>
W&auml;hlen Sie <em>Senderliste aktualisieren</em>, um TV-Browser nach neuen Sendern suchen zu lassen (Hierf&uuml;r ist eine Verbindung zum Internet notwendig).<br />
TV-Browser pr&uuml;ft selbst&auml;ndig regelm&auml;&szlig;ig auf neue Sender. Verwenden Sie diese Funktion, wenn die Senderliste auf der linken Seite leer ist oder sie vermuten, da&szlig; neue Sender verf&uuml;gbar sind.
</p>

<h3>Ausgew&auml;hlte Sender konfigurieren</h3>
<p>
Mit dem Knopf <em>Ausgew&auml;hlte Sender konfigurieren</em> k&ouml;nnen Sie weitere Einstellungen zu Sendern vornehmen, die Sie auf der rechten Seite selektiert haben.<br />
Die &Auml;nderungen, die Sie dann vornehmen, wirken sich nur auf die selektierten Sender aus.
</p>

<a name="lookandfeel"></a>
<h2>Look&Feel</h2>

<img src="img05.png" width="547" height="402"></img>

<p>
Auf der <a href="http://tvbrowser.sourceforge.net" target="_blank">TV-Browser-Website</a> finden Sie "themepacks" (skins) zum Herunterladen.
</p>
<p>
Achtung: Die heruntergeladene Datei (.ZIP-Datei) nicht entpacken!
</p>
<p>
Setzen Sie ein H&auml;kchen vor <em>Skin Look&Feel verwenden</em> und geben Sie Pfad und Dateiname zum heruntergeladenen Themepack an.
</p>
<p>
&Auml;nderungen des Themepacks werden zwar sofort &uuml;bernommen, trotzdem steht das neue Look&Feel erst mit dem n&auml;chsten Programmstart komplett zur Verf&uuml;gung.
</p>

<a name="programs"></a>
<h2>Sendungsanzeige</h2>

<img src="img06.png" width="547" height="443"></img>
<p>
Im Bereich <em>Sendungsanzeige</em> legen Sie fest, wie die Sendungen in der Programmtabelle dargestellt werden sollen.
</p>
<p>
<h3>Plugin-Icons</h3>
<p>
Manche Plugins sind in der Lage, Symbole unter der Beginnzeit-Angabe von Sendungen zu plazieren. Hier k&ouml;nnen Sie einstellen, welche Plugins Symbole zeichnen d&uuml;rfen und in welcher Reihenfolge diese Symbole dargestellt werden.
</p>

<h3>Infotext</h3>
<p>
Der Infotext ist jender Text, der unter dem Sendungstitel steht.<br />
Markieren Sie hier jene Felder, die in der Programmtabelle dargestellt werden sollen und bestimmen Sie die Reihenfolge der Darstellung.
</p>
<p>
Bitte beachten Sie, da&szlig; die Programminformationen die uns zur Verf&uuml;gung stehen, nicht immer detailiert genug sind, um alle Informatioen anzeigen zu k&ouml;nnen.
</p>

<a name="contextmenu"></a>
<h2>Kontextmen&uuml;</h2>

<img src="img07.png" width="547" height="443"></img>
<p>
In diesem Abschnitt k&ouml;nnen Sie die Reihenfolge der Elemente des Kontextmen&uuml;s bestimmen. Jeder Eintrag im Kontextmen&uuml; entspricht dabei einem der installierten Plugins.<br />
Au&szlig;erdem legen Sie hier fest, welcher Befehl (d.h. welches Plugin)per Doppelklick auf eine Sendung in der Programmtabelle ausgef&uuml;hrt wird. Selektieren Sie hierf&uuml;r das gew&uuml;nschte Element und klicken Sie auf <em>Selektiertes Plugin per Doppelklick ausf&uuml;hren</em>.
</p>

<a name="plugins"></a>
<h2>Plugins</h2>

<img src="img08.png" width="547" height="443"></img>
<p>
Die Liste der verf&uuml;gbaren Plugins zeigt alle Plugins an, die w&auml;hrend des Starts von TV-Browser im Verzeichnis <em>plugins</em> gefunden worden sind.<br />
Sie haben hier die M&ouml;glichkeit, einzelne Plugins zu aktivieren bzw. zu deaktivieren.<br />
Aktivierte Plugins k&ouml;nnen &uuml;ber das Kontextmen&uuml; und/oder das Programm-Men&uuml; angesprochen werden.<br />
Deaktivierte Plugins scheinen in keinem Men&uuml; auf.
</p>


<a name="tvdataservice"></a>
<h2>TV-DataServices</h2>

Im Abschnitt <em>TVDataServices</em> k&ouml;nnen Sie installierte DataServices konfigurieren.<br />
DataServices sind Plugins, die f&uuml;r das Laden der TV-Programm-Daten zust&auml;ndig sind. Um TV-Browser betreiben zu k&ouml;nnen, mu&szlig; mindestens <em>ein</em> TVDataService installiert sein.< br/>
Die TV-Browser-Standardinstallation beinhaltet das Plugin TV-BrowserDataService, das die TV-Daten l&auml;dt, die vom TV-Browser-Team angeboten werden.<br />
Die folgende Beschreibung bezieht sich auf eine Standardinstallation.

<p>
<img src="img09.png" width="547" height="443"></img>
</p>

Im Karteireiter <em>Zusatzdaten</em> k&ouml;nnen Sie ausw&auml;hlen, welche zus&auml;tzlichen Programmdaten TV-Browser herunterladen soll.<br />
Verzichten Sie auf Zusatzdaten, wenn Sie eine langsamere Internetverbindung haben, bzw. wenn sie keine zus&auml;tzlichen Filmbeschreibungen ben&ouml;tigen.

<p>
<img src="img09.png" width="547" height="443"></img>
</p>

Im Karteireiter <em>Sendergruppen</em> k&ouml;nnen Sie weitere Sendergruppen hinzuf&uuml;gen.<br />
Eine Sendergruppe ist eine Gruppe von Sendern, die von jemandem auf einem Server betreut wird. Sendergruppen haben wir eingef&uuml;hrt, damit auch andere Personen TV-Programm-Daten anbieten k&ouml;nnen.<br />
Ob weitere Sendergruppen zur Verf&uuml;gung stehen, erfahren Sie auf der <a href="http://tvbrowser.sourceforge.net" target="_blank">TV-Browser-Website</a>. Dort erfahren Sie auch, wie selber TV-Daten anbieten k&ouml;nnen.
</body>
</html>