#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Tue Mar 12 15:38:59 CET 2013
CopyWaitingDlg.appdataHeaderMsg=\u03A4\u03B1 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03B1 \u03BA\u03B1\u03B9 \u03BF\u03B9 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 \u03B1\u03BD\u03C4\u03B9\u03B3\u03C1\u03AC\u03C6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF\u03BD \u03BA\u03B1\u03C4\u03AC\u03BB\u03BF\u03B3\u03BF \u03C4\u03BF\u03C5 Windows appdata (\u03B1\u03C5\u03C4\u03CC \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B4\u03B9\u03B1\u03C1\u03BA\u03AD\u03C3\u03B5\u03B9 \u03BC\u03B5\u03C1\u03B9\u03BA\u03AC \u03BB\u03B5\u03C0\u03C4\u03AC). \u039C\u03C0\u03BF\u03C1\u03B5\u03AF\u03C4\u03B5 \u03BD\u03B1 \u03B4\u03B9\u03B1\u03B3\u03C1\u03AC\u03C8\u03B5\u03C4\u03B5 \u03C4\u03BF\u03BD \u03C0\u03B1\u03BB\u03B9\u03CC \u03BA\u03B1\u03C4\u03AC\u03BB\u03BF\u03B3\u03BF \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03C9\u03BD, \u03B1\u03BD \u03B4\u03B5\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B5 \u03BC\u03B9\u03B1 \u03C0\u03B1\u03BB\u03B9\u03AC \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7 \u03C4\u03BF\u03C5 TV-Browser. 
CopyWaitingDlg.exportHeader=\u03A4\u03B1 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03B1 \u03BA\u03B1\u03B9 \u03BF\u03B9 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 \u03B1\u03BD\u03C4\u03B9\u03B3\u03C1\u03AC\u03C6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C3\u03C4\u03BF \u03C3\u03CD\u03C3\u03C4\u03B7\u03BC\u03B1 \u03BA\u03B1\u03C4\u03B1\u03BB\u03CC\u03B3\u03BF\u03C5 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03C9\u03BD (\u03B1\u03C5\u03C4\u03CC \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C7\u03C1\u03B5\u03B9\u03B1\u03C3\u03C4\u03B5\u03AF \u03BC\u03B5\u03C1\u03B9\u03BA\u03AC \u03BB\u03B5\u03C0\u03C4\u03AC).
CopyWaitingDlg.pleaseWait=\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03BB\u03CE \u03C0\u03B5\u03C1\u03B9\u03BC\u03AD\u03BD\u03B5\u03C4\u03B5 \u03BC\u03AD\u03C7\u03C1\u03B9 \u03C4\u03B1 \u03B1\u03C1\u03C7\u03B5\u03AF\u03B1 \u03BD\u03B1 \u03B1\u03BD\u03C4\u03B9\u03B3\u03C1\u03B1\u03C6\u03B8\u03BF\u03C5\u03BD.
CopyWaitingDlg.waitingHeader=\u0395\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03AE \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD (\u03B1\u03C5\u03C4\u03CC \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C0\u03AC\u03C1\u03B5\u03B9 \u03BC\u03B5\u03C1\u03B9\u03BA\u03AC \u03BB\u03B5\u03C0\u03C4\u03AC). 
CopyWaitingDlg.waitingHeaderCopy=\u0391\u03BD\u03C4\u03B9\u03B3\u03C1\u03B1\u03C6\u03AE \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD (\u03B1\u03C5\u03C4\u03CC \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C0\u03AC\u03C1\u03B5\u03B9 \u03BC\u03B5\u03C1\u03B9\u03BA\u03AC \u03BB\u03B5\u03C0\u03C4\u03AC). 
CopyWaitingDlg.waitingSettingsHeader=\u0395\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03AE \u03C4\u03C9\u03BD \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03C9\u03BD \u03C4\u03B7\u03C2 \u03C0\u03C1\u03BF\u03B7\u03B3\u03BF\u03CD\u03BC\u03B5\u03BD\u03B7\u03C2 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7\u03C2 (\u03B1\u03C5\u03C4\u03CC \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B4\u03B9\u03B1\u03C1\u03BA\u03AD\u03C3\u03B5\u03B9 \u03BC\u03B5\u03C1\u03B9\u03BA\u03AC \u03BB\u03B5\u03C0\u03C4\u03AC). 
SettingsWaitingDialog.pleaseWait=\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03BB\u03CE \u03C0\u03B5\u03C1\u03B9\u03BC\u03AD\u03BD\u03B5\u03C4\u03B5 \u03C4\u03B7\u03BD \u03C6\u03CC\u03C1\u03C4\u03C9\u03C3\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03AF\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03CE\u03BD. 
SettingsWaitingDialog.waitingHeader=\u03A6\u03BF\u03C1\u03C4\u03C9\u03C3\u03B7 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD \u03C0\u03BF\u03C5 \u03B4\u03B5\u03BD \u03C5\u03B1\u03C0\u03C1\u03C7\u03B5\u03B9 \u03C0\u03B5\u03C1\u03B9\u03B3\u03C1\u03B1\u03C6\u03B7
