#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Tue Mar 12 15:38:59 CET 2013
TVBrowser.alreadyRunning=\u03A4\u03BF TV-Browser \u03B5\u03BA\u03C4\u03B5\u03BB\u03B5\u03AF\u03C4\u03B1\u03B9 \u03AE\u03B4\u03B7 
TVBrowser.downloadwait=\u0397 \u03B1\u03C5\u03C4\u03CC\u03BC\u03B1\u03C4\u03B7 \u03B1\u03BD\u03B1\u03BD\u03B5\u03C9\u03C3\u03B7 \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03BE\u03B5\u03BA\u03B9\u03BD\u03AC \u03C3\u03B5 {0} \u03B4\u03B5\u03C5\u03C4\u03B5\u03C1\u03CC\u03BB\u03B5\u03C0\u03C4\u03B1.\n
TVBrowser.error.1=\u0394\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B4\u03C5\u03BD\u03B1\u03C4\u03AE \u03B7 \u03B5\u03BC\u03C6\u03AC\u03BD\u03B9\u03C3\u03B7 \u03C4\u03BF\u03C5 look and feel.
TVBrowser.error.2=\u03A4\u03C1\u03B5\u03BE\u03B9\u03BC\u03BF \u03C4\u03BF\u03C5 TV-Browser \u03C3\u03C4\u03BF\u03BD \u03C7\u03C9\u03C1\u03BF \u03B1\u03C0\u03BF\u03B8\u03B7\u03BA\u03B5\u03C5\u03C3\u03B7\u03C2 \u03C4\u03BF\u03C5
TVBrowser.error.4=\u0394\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B4\u03C5\u03BD\u03B1\u03C4\u03AE \u03B7 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03AF\u03B1 \u03C4\u03BF\u03C5 \u03B1\u03C1\u03C7\u03B5\u03AF\u03BF\u03C5 \u03BA\u03B1\u03C4\u03B1\u03B3\u03C1\u03B1\u03C6\u03AE\u03C2. 
TVBrowser.error.noWriteRightsText=\u03A7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03AF\u03C4\u03B5 \u03C4\u03B7\u03BD \u03C6\u03BF\u03C1\u03B7\u03C4\u03B7 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7 \u03C4\u03BF\u03C5 TV-Browser, \u03B1\u03BB\u03BB\u03AC \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03C4\u03B5 \u03B4\u03B9\u03BA\u03B1\u03B9\u03CE\u03BC\u03B1\u03C4\u03B1 \u03B5\u03B3\u03B3\u03C1\u03AC\u03C6\u03B7\u03C2 \u03C3\u03C4\u03BF\u03BD \u03BA\u03B1\u03C4\u03AC\u03BB\u03BF\u03B3\u03BF \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03C9\u03BD\:\n\n'{0}'\n\n\u03A4\u03BF TV-Browser \u03B8\u03B1 \u03C4\u03B5\u03C1\u03BC\u03B1\u03C4\u03B9\u03C3\u03B8\u03B5\u03B9.
TVBrowser.error.noWriteRightsTitle=\u039A\u03B1\u03BD\u03AD\u03BD\u03B1 \u03B4\u03B9\u03BA\u03B1\u03AF\u03C9\u03BC\u03B1 \u03B5\u03B3\u03B3\u03C1\u03B1\u03C6\u03AE\u03C2 \u03C3\u03C4\u03BF\u03BD \u03BA\u03B1\u03C4\u03AC\u03BB\u03BF\u03B3\u03BF \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03C9\u03BD 
TVBrowser.exportDlgTitle=\u0395\u03BE\u03B1\u03B3\u03C9\u03B3\u03B7 \u03C4\u03C9\u03BD \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03B7\u03C3\u03B5\u03C9\u03BD
TVBrowser.importDlgTitle=\u0395\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03B7 \u03C4\u03C9\u03BD \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03B7\u03C3\u03B5\u03C9\u03BD
TVBrowser.importtvdata=\u0395\u03B9\u03C3\u03B1\u03B3\u03C9\u03B3\u03B7 \u03C4\u03C9\u03BD \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03B7\u03C3\u03B5\u03C9\u03BD
TVBrowser.lnfMissing=\u03A4\u03BF Java look and feel\n'{0}'\n\u03B4\u03B5\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 \u03B4\u03B9\u03B1\u03B8\u03B5\u03C3\u03B9\u03BC\u03BF, \u03B8\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B7\u03B8\u03B5\u03B9 \u03C4\u03BF \u03C0\u03C1\u03BF\u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03BC\u03B5\u03BD\u03BF look and feel.\n\n\u0398\u03AD\u03BB\u03B5\u03C4\u03B5 \u03BD\u03B1 \u03BF\u03C1\u03AF\u03C3\u03B5\u03C4\u03B5 \u03C4\u03B7\u03BD \u03B5\u03C0\u03B9\u03BB\u03BF\u03B3\u03AE "\u0395\u03BC\u03C6\u03AC\u03BD\u03B9\u03C3\u03B7" \u03B3\u03B9\u03B1 \u03C4\u03BF \u03C0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03B5\u03B3\u03BC\u03AD\u03BD\u03BF look and feel?
TVBrowser.lnfMissing.title=\u039B\u03B5\u03B9\u03C0\u03B5\u03B9 \u03C4\u03BF look and feel
TVBrowser.registryCancel=\u039A\u03BB\u03B5\u03B9\u03C3\u03B9\u03BC\u03BF \u03C4\u03BF\u03C5 TV-Browser
TVBrowser.registryChanged=\u03A4\u03BF \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03CC \u03CC\u03C1\u03B9\u03BF \u03AC\u03BB\u03BB\u03B1\u03BE\u03B5 \u03BC\u03B5 \u03B5\u03C0\u03B9\u03C4\u03C5\u03C7\u03AF\u03B1. \n\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03BB\u03BF\u03CD\u03BC\u03B5 \u03B5\u03C0\u03B1\u03BD\u03B5\u03BA\u03BA\u03B9\u03BD\u03AE\u03C3\u03C4\u03B5 \u03C4\u03BF Windows\!\n
TVBrowser.registryJumpOver=\u039F\u03C7\u03B9 \u03C4\u03C9\u03C1\u03B1
TVBrowser.registryNotChanged=<html>\u0394\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03C3\u03B5 \u03BD\u03B1 \u03B1\u03BB\u03BB\u03AC\u03C7\u03B8\u03B5\u03B9 \u03B7 \u03C4\u03B9\u03BC\u03AE \u03BC\u03B7\u03C4\u03C1\u03CE\u03BF\u03C5. \u038A\u03C3\u03C9\u03C2 \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03C4\u03B5 \u03C4\u03BF \u03B4\u03B9\u03BA\u03B1\u03AF\u03C9\u03BC\u03B1 \u03BD\u03B1 \u03C4\u03BF \u03BA\u03AC\u03BD\u03B5\u03C4\u03B5.<br>\u0391\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03AD\u03C4\u03C3\u03B9 \u03B5\u03C0\u03B9\u03BA\u03BF\u03B9\u03BD\u03C9\u03BD\u03AE\u03C3\u03C4\u03B5 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03C7\u03B5\u03B9\u03C1\u03B9\u03C3\u03C4\u03AE \u03C3\u03B1\u03C2 \u03BA\u03B1\u03B9 \u03B1\u03C6\u03AE\u03C3\u03C4\u03B5 \u03C4\u03BF\u03BD \u03BD\u03B1 \u03C4\u03BF \u03BA\u03AC\u03BD\u03B5\u03B9 \u03B3\u03B9\u03B1 \u03C3\u03B1\u03C2.<br><br><b>\u03A0\u03C1\u03BF\u03C3\u03BF\u03C7\u03B7\:</b> \u0397 \u03B1\u03BA\u03BF\u03BB\u03BF\u03C5\u03B8\u03B7 \u03C0\u03B5\u03C1\u03B9\u03B3\u03C1\u03B1\u03C6\u03B7 \u03B5\u03B9\u03BD\u03B1\u03B9 \u03B3\u03B9\u03B1 \u03B5\u03B9\u03B4\u03B9\u03BA\u03BF\u03C5\u03C2. \u0391\u03BD \u03B1\u03BB\u03BB\u03AC\u03BE\u03B5\u03C4\u03B5 \u03AE \u03B4\u03B9\u03B1\u03B3\u03C1\u03AC\u03C8\u03B5\u03C4\u03B5 \u03C4\u03B7\u03BD \u03BB\u03AC\u03B8\u03BF\u03C2 \u03C4\u03B9\u03BC\u03AE \u03C3\u03C4\u03BF \u03BC\u03B7\u03C4\u03C1\u03CE\u03BF \u03B8\u03B1 \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03C3\u03B5 \u03BD\u03B1 \u03BA\u03B1\u03C4\u03B1\u03C3\u03C4\u03C1\u03B1\u03C6\u03B5\u03B9 \u03B7 \u03B5\u03B3\u03BA\u03B1\u03C4\u03AC\u03C3\u03C4\u03B1\u03C3\u03B7 \u03C4\u03BF\u03C5 Windows \u03C3\u03B1\u03C2.<br><br>\u0393\u03B9\u03B1 \u03BD\u03B1 \u03C0\u03AC\u03C1\u03B5\u03C4\u03B5 \u03BA\u03B1\u03BC\u03AF\u03B1 \u03C0\u03C1\u03BF\u03B5\u03B9\u03B4\u03BF\u03C0\u03BF\u03AF\u03B7\u03C3\u03B7 \u03B3\u03B9\u03B1 TV-Browser \u03BE\u03B5\u03BA\u03B9\u03BD\u03AE\u03C3\u03C4\u03B5 \u03C4\u03B7\u03BD \u03C4\u03B9\u03BC\u03AE \u03BC\u03B7\u03C4\u03C1\u03CE\u03BF\u03C5 <b>WaitToKillAppTimeout</b> in the registry path<br><b>HKEY_CURRENT_USER\\Control Panel\\Desktop</b> has to be at least <b>5000</b> or the value for <b>AutoEndTasks</b> in the same path has to be <b>0</b>.</html>
TVBrowser.registryWarning=\u039F \u03B3\u03C1\u03AE\u03B3\u03BF\u03C1\u03BF\u03C2 \u03C4\u03B5\u03C1\u03BC\u03B1\u03C4\u03B9\u03C3\u03BC\u03BF\u03C2 \u03C4\u03BF\u03C5 Windows \u03B5\u03BD\u03B5\u03C1\u03B3\u03BF\u03C0\u03BF\u03B9\u03B7\u03B8\u03B7\u03BA\u03B5. \n\u03A4\u03BF \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03CC \u03CC\u03C1\u03B9\u03BF \u03B3\u03B9\u03B1 \u03C5\u03C0\u03BF\u03BC\u03BF\u03BD\u03B7 \u03C0\u03C1\u03B9\u03BD \u03C4\u03BF \u03BA\u03BB\u03B5\u03B9\u03C3\u03B5\u03B9 Windows \u03BC\u03B9\u03B1 \u03B5\u03C6\u03B1\u03C1\u03BC\u03BF\u03B3\u03AE \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C0\u03BF\u03BB\u03CD \u03BC\u03B9\u03BA\u03C1\u03BF,\n\u03B3\u03B9\u03B1 \u03BD\u03B1 \u03B5\u03C7\u03B5\u03B9 \u03C4\u03BF TV-Browser \u03B1\u03C1\u03BA\u03B5\u03C4\u03BF \u03C7\u03C1\u03BF\u03BD\u03BF \u03B3\u03B9\u03B1 \u03B1\u03C0\u03BF\u03B8\u03B7\u03BA\u03B5\u03C5\u03C3\u03B7 \u03C4\u03C9\u03BD \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03C9\u03BD.\n\n\u0397 \u03C1\u03CD\u03B8\u03BC\u03B9\u03C3\u03B7 \u03B4\u03B5\u03BD \u03AD\u03C7\u03B5\u03B9 \u03C4\u03B7\u03BD \u03C0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03B5\u03B3\u03BC\u03AD\u03BD\u03B7 \u03C4\u03B9\u03BC\u03AE. \u0391\u03C5\u03C4\u03CC \u03AC\u03BB\u03BB\u03B1\u03BE\u03B5 \u03BC\u03B5 \u03AD\u03BD\u03B1 \u03B5\u03C1\u03B3\u03B1\u03BB\u03B5\u03AF\u03BF \u03AE \u03B1\u03C0\u03CC \u03B5\u03C3\u03AC\u03C2. \n\u03A4\u03BF TV-Browser \u03B8\u03B1 \u03C0\u03C1\u03BF\u03C3\u03C0\u03B1\u03B8\u03AE\u03C3\u03B5\u03B9 \u03BD\u03B1 \u03B1\u03BB\u03BB\u03AC\u03BE\u03B5\u03B9 \u03C4\u03BF \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03CC \u03BF\u03C1\u03B9\u03BF. \n\n\u0391\u03BD \u03B4\u03B5\u03BD \u03B8\u03AD\u03BB\u03B5\u03C4\u03B5 \u03BD\u03B1 \u03B1\u03BB\u03BB\u03AC\u03C7\u03B8\u03B5\u03B9 \u03C4\u03BF \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03CC \u03CC\u03C1\u03B9\u03BF \u03B5\u03C0\u03B9\u03BB\u03AD\u03BE\u03C4\u03B5 \u00AB\u038C\u03C7\u03B9 \u03B1\u03C5\u03C4\u03AE \u03C4\u03B7 \u03C6\u03BF\u03C1\u03AC\u00BB \u03AE \u00AB\u039A\u03BB\u03B5\u03B9\u03C3\u03B9\u03BC\u03BF \u03C4\u03BF\u03C5 TV - Browser\u00BB.\n
TVBrowser.startAnyway=\u0395\u03BD\u03B1\u03C1\u03BE\u03B7 \u03BC\u03B5 \u03BA\u03B1\u03B8\u03B5 \u03C4\u03C1\u03BF\u03C0\u03BF
TVBrowser.startScreen.dataService=\u03A6\u03BF\u03C1\u03C4\u03C9\u03C3\u03B7 \u03C4\u03C9\u03BD \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03B7\u03C3\u03B5\u03C9\u03BD...
TVBrowser.startScreen.laf=\u03A6\u03BF\u03C1\u03C4\u03C9\u03C3\u03B7 \u03C4\u03BF\u03C5 look and feel...
TVBrowser.startScreen.plugins=\u03A6\u03BF\u03C1\u03C4\u03C9\u03C3\u03B7 \u03C4\u03C9\u03BD plugins... 
TVBrowser.startScreen.tvData=\u0395\u03BB\u03B5\u03B3\u03C7\u03BF\u03C2 \u03C4\u03B7\u03C2 \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03B7\u03C2 \u03B2\u03B1\u03C3\u03B7\u03C2 \u03B4\u03B5\u03B4\u03BF\u03BC\u03B5\u03BD\u03C9\u03BD...
TVBrowser.startScreen.ui=\u0395\u03BA\u03BA\u03AF\u03BD\u03B7\u03C3\u03B7... 
TVBrowser.timeInfoText=\u03A4\u03BF \u03C7\u03C1\u03BF\u03BD\u03B9\u03BA\u03CC \u03B5\u03CD\u03C1\u03BF\u03C2 \u03C4\u03BF\u03C5 \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1 \u03C0\u03C1\u03CC\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03C9\u03BD \u03B4\u03B9\u03BF\u03C1\u03B8\u03CE\u03B8\u03B7\u03BA\u03B5, \u03B5\u03C0\u03B5\u03B9\u03B4\u03AE \u03B7 \u03BA\u03B1\u03B8\u03BF\u03C1\u03B9\u03C3\u03BC\u03AD\u03BD\u03B7 \u03B7\u03BC\u03AD\u03C1\u03B1 \u03AE\u03C4\u03B1\u03BD \u03BC\u03B9\u03BA\u03C1\u03CC\u03C4\u03B5\u03C1\u03B7 \u03B1\u03C0\u03CC 24 \u03CE\u03C1\u03B5\u03C2.\n\n\u0395\u03AC\u03BD \u03BF \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1\u03C2 \u03C0\u03C1\u03CC\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B4\u03B5\u03AF\u03BE\u03B5\u03B9 \u03C4\u03BF \u03BB\u03B9\u03B3\u03CC\u03C4\u03B5\u03C1\u03BF \u03B1\u03C0\u03CC 24 \u03CE\u03C1\u03B5\u03C2 \u03A7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03AE\u03C3\u03C4\u03B5 \u03AD\u03BD\u03B1 \u03C6\u03AF\u03BB\u03C4\u03C1\u03BF \u03C7\u03C1\u03CC\u03BD\u03BF \u03B3\u03B9\u03B1 \u03B1\u03C5\u03C4\u03CC. \u03A4\u03BF \u03C6\u03AF\u03BB\u03C4\u03C1\u03BF \u03B1\u03C5\u03C4\u03CC \u03C7\u03C1\u03CC\u03BD\u03BF \u03BC\u03C0\u03BF\u03C1\u03BF\u03CD\u03BD \u03BD\u03B1 \u03B5\u03C0\u03B9\u03BB\u03B5\u03C7\u03C4\u03BF\u03CD\u03BD \u03BD\u03B1 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C4\u03BF \u03C0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03B5\u03B3\u03BC\u03AD\u03BD\u03BF \u03C6\u03AF\u03BB\u03C4\u03C1\u03BF \u03B5\u03C0\u03B9\u03BB\u03AD\u03B3\u03BF\u03BD\u03C4\u03AC\u03C2 \u03C4\u03B9\u03C2 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 \u03C6\u03AF\u03BB\u03C4\u03C1\u03BF\u03C5 \u03BA\u03B1\u03B9 \u03C0\u03B1\u03C4\u03CE\u03BD\u03C4\u03B1\u03C2 \u03C3\u03C4\u03BF \u03BA\u03BF\u03C5\u03BC\u03C0\u03AF "\u03A0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03BF\u03B3\u03AE".\n 
TVBrowser.timeInfoTitle=\u0394\u03B9\u03BF\u03C1\u03B8\u03C9\u03C3\u03B7 \u03C9\u03C1\u03B1\u03C2
TVBrowser.tvDataFilter=\u03A4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03B5\u03C2 \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03B7\u03C3\u03B5\u03B9\u03C2 ({0})
