
TVBrowser.alreadyRunning           = Eine Instanz von TV-Browser l\u00E4uft bereits
TVBrowser.downloadwait             = Automatisches Datenupdate startet in {0} Sekunden.
TVBrowser.error.1                  = Konnte Look and Feel nicht setzen.
TVBrowser.error.2                  = Bitte starten Sie TV-Browser im TV-Browser-Verzeichnis!
TVBrowser.error.4                  = Konnte Logdatei nicht erstellen.
TVBrowser.error.noWriteRightsText  = Sie verwenden die transportable Version von TV-Browser, haben jedoch keine Schreibrechte im Einstellungsverzeichnis:\r\n\r\n'{0}'\r\n\r\nTV-Browser wird beendet.
TVBrowser.error.noWriteRightsTitle = Keine Schreibrechte im Einstellungsverzeichnis
TVBrowser.exportDlgTitle           = TV-Daten exportieren
TVBrowser.importDlgTitle           = TV-Daten importieren
TVBrowser.importtvdata             = TV-Daten importieren
TVBrowser.lnfMissing               = Die Java-Bibliothek f\u00FCr die konfigurierbare Ansicht\n'{0}'\nist nicht l\u00E4nger verf\u00FCgbar, deshalb wird die Standard-Ansicht benutzt.\n\nWollen Sie die Option f\u00FCr die Ansicht auf den Standard zur\u00FCcksetzen?
TVBrowser.lnfMissing.title         = Fehlende Java-Klasse
TVBrowser.registryCancel           = TV-Browser beenden
TVBrowser.registryChanged          = Die Wartezeit wurde erfolgreich ge\u00E4ndert.\nBitte starten Sie Windows neu!
TVBrowser.registryJumpOver         = Diesmal \u00FCberspringen
TVBrowser.registryNotChanged       = <html>Die \u00C4nderung des Registry-Eintrags konnte nicht vorgenommen werden. M\u00F6glicherweise fehlen Ihnen daf\u00FCr die Rechte.<br>Wenden Sie sich in diesem Fall an Ihren Administrator, damit er die \u00C4nderung f\u00FCr Sie durchf\u00FChrt.<br><br><b>Warnung:</b> Folgende Anleitung ist nur f\u00FCr Experten gedacht. Sie k\u00F6nnten Ihr Windows irreparabel zerst\u00F6ren, sollten Sie falsche Werte l\u00F6schen oder \u00E4ndern.<br><br>Damit TV-Browser keine Warnung mehr ausgibt, muss der Wert f\u00FCr <b>WaitToKillAppTimeout</b> im Registry-Pfad<br><b>HKEY_CURRENT_USER\\Control Panel\\Desktop</b> mindestens <b>5000</b> betragen oder der Wert f\u00FCr <b>AutoEndTasks</b> im gleichen Registry-Pfad muss <b>0</b> sein.</html>
TVBrowser.registryWarning          = Das Schnelle Herunterfahren von Windows ist aktviert.\nDie eingegebene Wartezeit, bevor ein Programm von Windows beendet wird, ist jedoch\nzu kurz, um ein sauberes Speichern der Einstellungen von TV-Browser sicherzustellen.\n\nDies ist nicht die Standard-Einstellung von Windows. Entweder wurde diese Einstellung durch ein Tool oder Sie ver\u00E4ndert.\nTV-Browser wird jetzt versuchen die Wartezeit auf einen zuverl\u00E4ssigen Wert zu setzen.\n\nSollten Sie dies nicht w\u00FCnschen, w\u00E4hlen Sie 'Diesmal \u00FCberspringen' oder 'TV-Browser beenden'.
TVBrowser.splash.dataService       = Lade Daten-Services...
TVBrowser.splash.laf               = Lade Aussehen...
TVBrowser.splash.plugins           = Lade Plugins...
TVBrowser.splash.tvData            = Pr\u00FCfe TV-Datenbestand...
TVBrowser.splash.ui                = Starte...
TVBrowser.startAnyway              = Trotzdem starten
TVBrowser.timeInfoText             = Die Tagesgrenzen der Programmtabelle wurden korrigiert, da sie einen Tag von unter 24 Stunden definierten.\n\nWenn die Programmtabelle weniger als 24h anzeigen soll, benutzen Sie daf\u00FCr bitte einen Zeitfilter! Dieser l\u00E4sst\nsich in den Filtereinstellungen durch Auswahl und das Dr\u00FCcken auf den Button 'Standard' als Standardfilter einstellen.
TVBrowser.timeInfoTitle            = Zeiten korrigiert
TVBrowser.tvDataFilter             = TV-Daten ({0})
