#Generated by ResourceBundle Editor (http://eclipse-rbe.sourceforge.net)
#Saved by i18n Plugin Version 2.6.0.0
#Mon Oct 15 13:12:39 CEST 2007

TVBrowser.alreadyRunning           = TV-Browser k\u00F6rs redan.
TVBrowser.close                    = St\u00E4ng
TVBrowser.error.1                  = Kunde inte ladda skin
TVBrowser.error.2                  = V\u00E4nligen starta TV-Browser i TV-Browser katalogen!
TVBrowser.error.4                  = Kan inte skapa logg
TVBrowser.exportDlgTitle           = Exportera TV listor
TVBrowser.importDlgTitle           = Importera TV lista
TVBrowser.importtvdata             = Importera TV-listor
TVBrowser.registryCancel           = St\u00E4ng TV-Browser
TVBrowser.registryChanged          = \u00C4ndring av Timeout lyckades.\nVar god starta om Windows!
TVBrowser.registryJumpOver         = Inte denna g\u00E5ng
TVBrowser.registryNotChanged       = <html>Registerv\u00E4rdet gick inte att \u00E4ndra, du kanske inte har beh\u00F6righet till detta<br>Ifall du inte har beh\u00F6righet kontakta din administrat\u00F6r och be denne g\u00F6ra det<br><br><b>Uppm\u00E4rksamma:</b> F\u00F6ljande beskrivning \u00E4r f\u00F6r experter. Om du \u00E4ndrar eller tar bort fel v\u00E4rde i Registret kan du skada din Windowsinstallation<br><br>F\u00F6r att inte f\u00E5 n\u00E5gon varning i TV-Browser \u00F6ppna <b>WaitToKillAppTimeout</b> i Registermappen<br><b>HKEY_CURRENT_USER\\Control Panel\\Desktop</b> Ha minst <b>5000</b> eller v\u00E4rdet <b>AutoEndTasks</b> i samma mapp till <b>0</b>.</html>
TVBrowser.registryWarning          = Snabb avslutning av Windows \u00E4r aktiverad. \nTimeout att v\u00E4nta innan Windows st\u00E4nger ner programmen \u00E4r f\u00F6r kort,\nf\u00F6r att ge TV-Browser m\u00F6jlighet att spara alla inst\u00E4llningar.\n\nInst\u00E4llningarna har inte standardv\u00E4rden. Dessa var \u00E4ndrade via ett verktyg eller av dig.\nTV-Browser kommer nu att f\u00F6rs\u00F6ka \u00E4ndra Timeout.\n\nIfall du inte vill \u00E4ndra Timeout tryck p\u00E5 'Inte denna g\u00E5ng' eller 'St\u00E4ng TV-browser'
TVBrowser.splash.dataService       = Laddar TV program service...
TVBrowser.splash.laf               = Laddar skin...
TVBrowser.splash.plugins           = Laddar moduler...
TVBrowser.splash.tvData            = Kontrollerar TV databas...
TVBrowser.splash.ui                = Startar...
TVBrowser.startAnyway              = Starta \u00E4nd\u00E5
TVBrowser.timeInfoText             = Tidsgr\u00E4nsen f\u00F6r programtabellen \u00E4ndrades eftersom den definierade dagen var kortare \u00E4n 24 timmar.\n\nIfall programtabl\u00E5n skall vara kortare \u00E4n 24 timmar anv\u00E4nd ett filter f\u00F6r detta. Ett tidsfilter kan markeras att\nvara standardfilter genom att markera den i filterinst\u00E4llningarna och trycka p\u00E5 knappen 'Standard'.
TVBrowser.timeInfoTitle            = Tid korrigerad
TVBrowser.tvDataFilter             = TV listor ({0})
