#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Tue May 07 19:18:16 CEST 2013
TVBrowser.alreadyRunning=TV-Browser je ji\u017E spu\u0161t\u011Bn
TVBrowser.downloadwait=Automatick\u00E1 aktualizace dat za\u010Dne za {0} sekund.
TVBrowser.error.1=Nelze nastavit look and feel.
TVBrowser.error.2=Pros\u00EDm spus\u0165te TV-Browser ve slo\u017Ece TV-Browseru\!
TVBrowser.error.4=Nelze vytvo\u0159it log soubor.
TVBrowser.error.noWriteRightsText=Pou\u017E\u00EDv\u00E1te p\u0159enosnou verzi TV-Browseru, ale nem\u00E1te opr\u00E1vn\u011Bn\u00ED zapisovat do slo\u017Eky nastaven\u00ED\:\n\n'{0}'\n\nTV-Browser bude uzav\u0159en.
TVBrowser.error.noWriteRightsTitle=Nen\u00ED opr\u00E1vn\u011Bn\u00ED k z\u00E1pisu do slo\u017Eky nastaven\u00ED
TVBrowser.exportDlgTitle=Export TV program\u016F
TVBrowser.importDlgTitle=Import TV program\u016F
TVBrowser.importtvdata=Import TV program\u016F
TVBrowser.lnfMissing=Java look and feel\n'{0}'\nji\u017E nen\u00ED k dispozici, tak\u017Ee bude pou\u017Eit v\u00FDchoz\u00ED vzhled look and feel.\n\nChcete nastavit look and feel volbu na v\u00FDchoz\u00ED look and feel?
TVBrowser.lnfMissing.title=Look and feel chyb\u00ED
TVBrowser.registryCancel=Zav\u0159\u00EDt TV-Browser
TVBrowser.registryChanged=\u010Casov\u00FD limit byl \u00FAsp\u011B\u0161n\u011B zm\u011Bn\u011Bn.\nPros\u00EDm, restartujte Windows\!
TVBrowser.registryJumpOver=Nyn\u00ED ne
TVBrowser.registryNotChanged=<html>Hodnotu registru nelze zm\u011Bnit. Mo\u017En\u00E1 nem\u00E1te dostate\u010Dn\u00E1 opr\u00E1vn\u011Bn\u00ED.<br>Obra\u0165te se na spr\u00E1vce syst\u00E9mu.<br><br><b>Upozorn\u011Bn\u00ED\:</b> N\u00E1sleduj\u00EDc\u00ED popis je ur\u010Den pro odborn\u00EDky. Pokud zm\u011Bn\u00EDte nebo odstran\u00EDte nespr\u00E1vn\u00E9 hodnoty v registru, m\u016F\u017Eete po\u0161kodit instalaci syst\u00E9mu Windows.<br><br>Chcete-li se zbavit varov\u00E1n\u00ED p\u0159i spu\u0161t\u011Bn\u00ED TV-Browseru, hodnota registru <b>WaitToKillAppTimeout</b> v cest\u011B<br><b>HKEY_CURRENT_USER\\Control Panel\\Desktop</b> mus\u00ED b\u00FDt nejm\u00E9n\u011B <b>5000</b> nebo hodnota <b>AutoEndTasks</b> ve stejn\u00E9m adres\u00E1\u0159i mus\u00ED b\u00FDt <b>0</b>.</html>
TVBrowser.registryWarning=Rychl\u00E9 vypnut\u00ED syst\u00E9mu Windows je aktivov\u00E1no.\n\u010Cekac\u00ED \u010Dasov\u00FD limit aplikace p\u0159ed vypnut\u00EDm syst\u00E9mu Windows je p\u0159\u00EDli\u0161 kr\u00E1tk\u00FD,\nTV-Browser pot\u0159ebuje dostatek \u010Dasu pro ulo\u017Een\u00ED v\u0161ech nastaven\u00ED.\n\nNastaven\u00ED nem\u00E1 v\u00FDchoz\u00ED hodnotu. Ta byla zm\u011Bn\u011Bna n\u011Bjak\u00FDm n\u00E1strojem nebo V\u00E1mi.\nTV-Browser se nyn\u00ED pokus\u00ED zm\u011Bnit \u010Dasov\u00FD limit.\n\nPokud nechcete m\u011Bnit tento \u010Dasov\u00FD limit zvolte "Nyn\u00ED ne" nebo "Zav\u0159\u00EDt TV-Browser".
TVBrowser.startAnyway=P\u0159esto spustit
TVBrowser.startScreen.dataService=Na\u010D\u00EDt\u00E1m slu\u017Ebu TV program\u016F...
TVBrowser.startScreen.laf=Na\u010D\u00EDt\u00E1m look and feel...
TVBrowser.startScreen.plugins=Na\u010D\u00EDt\u00E1m pluginy...
TVBrowser.startScreen.tvData=Kontroluji TV datab\u00E1zi...
TVBrowser.startScreen.ui=Spou\u0161t\u00EDm...
TVBrowser.timeInfoText=\u010Casov\u00FD rozsah v tabulce program\u016F byl opraven, proto\u017Ee definovan\u00FD den byl krat\u0161\u00ED ne\u017E 24 hodin.\n\nPokud by tabulka program\u016F m\u011Bla uk\u00E1zat m\u00E9n\u011B ne\u017E 24 hodin, pou\u017Eijte pro to \u010Dasov\u00FD filtr.\n\u010Casov\u00FD filtr m\u016F\u017Ee b\u00FDt vybr\u00E1n jako v\u00FDchoz\u00ED filtr v\u00FDb\u011Brem v nastaven\u00ED filtr\u016F a kliknut\u00EDm na tla\u010D\u00EDtko "V\u00FDchoz\u00ED".
TVBrowser.timeInfoTitle=\u010Cas opraven
TVBrowser.tvDataFilter=TV programy ({0})
