#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Thu Dec 13 20:13:07 CET 2012
TVBrowser.alreadyRunning=TV-Browser se ve\u0107 izvodi. 
TVBrowser.downloadwait=Automatska dopuna podataka po\u010Dinje za {0} sekundi.
TVBrowser.error.1=Postavljanje izgleda i ugo\u0111aja nije uspjelo.
TVBrowser.error.2=Molimo da TV-Browser pokrenete u mapi TV-Browsera\!
TVBrowser.error.4=Nije bilo mogu\u0107e stvoriti zapisni\u010Dku datoteku.
TVBrowser.error.noWriteRightsText=Koristite prenosivu ina\u010Dicu TV-Browsera ali nemate ovlasti za pisanje u mapi postavki\:\n\n'{0}'\n\nTV-Browser \u0107e biti zatvoren.
TVBrowser.error.noWriteRightsTitle=Nemate ovlasti za pisanje u mapi postavki
TVBrowser.exportDlgTitle=Izvezi TV-podatke
TVBrowser.importDlgTitle=Uvezi TV-podatke
TVBrowser.importtvdata=Uvezi TV-podatke
TVBrowser.lnfMissing=Knji\u017Enica Jave za prilagodbe programskog izgleda i ugo\u0111aja\n'{0}'\nvi\u0161e nije dostupna. Stoga \u0107e se koristiti zadani izgled i ugo\u0111aj.\n\n\u017Delite li vratiti zadane postavke izgleda?
TVBrowser.lnfMissing.title=Knji\u017Enica Jave nije dostupna
TVBrowser.registryCancel=Zatvori TV-Browser
TVBrowser.registryChanged=Trajanje stanke je uspje\u0161no izmijenjeno.\nMolimo Vas da iznova pokrenete Windows\!
TVBrowser.registryJumpOver=Ovoga puta ne
TVBrowser.registryNotChanged=<html>Vrijednost registra nije mogla biti izmijenjena. Mo\u017Eda nemate ovla\u0161tenje da to u\u010Dinite.<br>Ukoliko je to tako obratite se svom administratoru i zamolite ga neka on to u\u010Dini umjesto Vas.<br><br><b>Pozor\:</b> Slijede\u0107i opis je namijenjen znalcima. Ukoliko u registru izmijenite ili izbri\u0161ete pogre\u0161nu vrijednost, mo\u017Eete razoriti Va\u0161u instalaciju Windowsa.<br><br>Da Vam TV-Browser vi\u0161e ne bi izdavao upozorenja, pokrenite registarsku vrijednost <b>WaitToKillAppTimeout</b> u stazi registra<br><b>HKEY_CURRENT_USER\\Control Panel\\Desktop</b> mora biti najmanje <b>5000</b> ili vrijednost za <b>AutoEndTasks</b> u istoj stazi mora biti <b>0</b>.</html>
TVBrowser.registryWarning=Aktivirano je brzo isklju\u010Divanje Windowsa.\nTrajanje razdoblja \u010Dekanja prije nego \u0161to \u0107e Windows zatvoriti neku aplikaciju je \nprekratko da bi TV-Browseru pru\u017Eilo dovoljno vremena da spremi sve postavke.\n\nOva postavka nema zadanu vrijednost. Nju je izmijenila neka alatka ili Vi osobno.\nTV-Browser \u0107e sada poku\u0161ati izmijeniti vrijeme \u010Dekanja.\n\nUkoliko trajanje te stanke ne \u017Eelite mijenjati, odaberite 'Ovoga puta ne' ili 'Zatvori TV-Browser'.
TVBrowser.splash.dataService=U\u010Ditavanje slu\u017Ebe TV-podataka...
TVBrowser.splash.laf=U\u010Ditavanje izgleda i ugo\u0111aja...
TVBrowser.splash.plugins=U\u010Ditavanje dodataka...
TVBrowser.splash.tvData=Provjera baze TV-podataka...
TVBrowser.splash.ui=Pokretanje...
TVBrowser.startAnyway=Ipak pokreni
TVBrowser.startScreen.dataService=U\u010Ditavanje slu\u017Ebe TV-podataka...
TVBrowser.startScreen.laf=U\u010Ditavanje izgleda i ugo\u0111aja...
TVBrowser.startScreen.plugins=U\u010Ditavanje programskih dodataka...
TVBrowser.startScreen.tvData=Provjera baze TV-podataka...
TVBrowser.startScreen.ui=Pokretanje...
TVBrowser.timeInfoText=Vremensko razdoblje programske tablice je ispravljeno jer je doti\u010Dni dan bio kra\u0107i od 24 sata.\n\nUkoliko programska tablica treba prikazivati manje od 24 sata, koristite filtar vremena. Taj filtar vremena mo\u017Ee biti odabran \nda bude zadani filtar njegovim odabirom u postavkama filtara i stiskom na gumb 'Zadano'.
TVBrowser.timeInfoTitle=Vremena su ispravljena
TVBrowser.tvDataFilter=TV-podatci ({0})
