<html>

	<head>
		<title>TV-Browser</title>
       <link rel="stylesheet" type="text/css" href="style.css">
	</head>
	<body>


<h1>PROGRAMMDATEN F&Uuml;R TV-BROWSER ANBIETEN</h1>
<h2>unter Verwendung der TV-Browser-Tools</h2>
<h1>Teil I</h1>



<p>
In Teil I des Tutorials verwenden wir fiktive TV-Daten, die von der
TV-Browser-Website erzeugt werden. Diese Daten werden von den hier
besprochenen Tools aufbereitet und dann auf einen Webserver geladen, auf den
TV-Browser dann zugreifen kann.<br />
Ziel von Teil I ist es, die Datenaufbereitung grunds&auml;tzlich zu
verstehen und eine lauff&auml;hige Umgebung f&uuml;r die TV-Browser-Tools zu
installieren.<br />
Um das Tutorial kurz und einfach zu halten, werde ich hier nur das erkl&auml;ren, was f&uuml;r das Verst&auml;ndnis unbedingt notwendig ist.<br />
Am Ende des ersten Teils werden wir eine neue Sendergruppe in TV-Browser einf&uuml;gen, die die Daten von 3 fiktiven Sendern auf dem Webspace enth&auml;lt.
</p>

<h4>Voraussetzungen:</h4>
<ul>
<li>Interesse am TV-Browser-TV-Datensystem</li>
<li>Webserver, auf dem TV-Daten angeboten werden k&ouml;nnen</li>
<li>FTP-Zugang zum Webserver</li>
<li>ein Betriebssystem, auf dem auch TV-Browser l&auml;uft</li>
<li>keine Programmierkenntnisse erforderlich</li>
</ul>


<p>
W&auml;hrend des gesamten Tutorials ben&ouml;tigen wir die DOS-Box, Konsole, Terminal (oder wie immer man das Teil auf dem jeweiligen System nennen mag).<br />
&Ouml;ffnen wir also die Konsole und wechseln wir in das Verzeichnis <em>workspace</em>. Das ist das Verzeichnis, in dem wir nun arbeiten werden (die Bedeutung der restlichen Verzeichnisse werde ich im Laufe des Tutorials erl&auml;utern).<br />
Wir sehen dort verschiedene Shell-Skripte - jeweils f&uuml;r Windows und die *nix-bash. Jedes Skript entspricht einem TV-Browser-Tool: PDSRunner, DataManager und MirrorUpdater. Sie werden uns einiges an Tipparbeit sparen. <br />
</p>

<h3>Schritt 1: Rohdaten erzeugen mit PDSRunner:</h3>
<p>
Das erste Tool, das wir ben&ouml;tigen ist der <em>PDSRunner</em>. PDSRunner liest
TV-Daten ein und konvertiert sie in ein eigenes Format f&uuml;r die sp&auml;tere
Weiterverarbeitung.
</p>
<p>
PDSRunner starten wir mit
</p>
<pre>pdsrunner</pre>

<p>
Als Ausgabe erhalten wir erstmal das hier:</p>
<pre>usage: PDSRunner [-raw directory] [-log directory] pds ...</pre>
<p>Was bedeutet das?<br />
PDSRunner ist dazu da, TV-Daten "einzusammeln". Das macht er, indem er fremde "Module" (Java-Klassen) aufruft, die ihm die Daten zur Verf&uuml;gung stellen.<br />
Wir (die Entwickler) nennen diese Module PrimaryDataServices - kurz PDS. Der einzige Programmieraufwand, den ein TV-Daten-Anbieter zu leisten hat, ist die Entwicklung eines solchen PDS.<br />
Hier k&uuml;mmern wir uns aber nicht darum. Dem Tutorial liegt bereits ein PDS bei, das wir verwenden k&ouml;nnen.
</p>
<p>
Wir m&uuml;ssen dem PDSRunner also mitteilen, welches PDS er verwenden soll. Das machen wir so:
</p>
<pre>pdsrunner SimplePDS</pre>


<p>
SimplePDS ist ein sehr einfaches PDS. Es liest TV-Daten von <a href="http://www.tvbrowser.org/pdsstarterkit/">einer Website</a> und &uuml;bergibt sie dem PDSRunner. Sowohl Sender als auch
die Programmvorschau sind dabei frei erfunden. Es soll damit nur verdeutlicht
werden, wie das Ganze grunds&auml;tzlich funktioniert. Das PDS befindet sich im Verzeichnis <em>java</em>.
</p>

<p>
Nachdem PDSRunner erfolgreich ausgef&uuml;hrt worden ist, finden wir ein neues
Verzeichnis mit dem Namen <em>raw</em> im workspace-Verzeichnis. Dort
befindet sich nun f&uuml;r jeden Tag und Sender jeweils eine Datei. Das sind
erstmal die Rohdaten.
</p>
<p class="note">
Die erhaltenen TV-Daten stammen von der TV-Browser-Website und sind vom Webserver
automatisch generierte Programminformationen.<br />
SimplePDS hat diese Daten von der Website ausgelesen.<br />
PDSRunner hat SimplePDS angesto&szlig;en und die TV-Daten von SimplePDS in ein
f&uuml;r unsere Tools verst&auml;ndliches Format gebracht und im Verzeichnis <em>raw</em>
abgelegt.<br />
Die urspr&uuml;nglichen Daten k&ouml;nnen <a href="http://www.tvbrowser.org/pdsstarterkit/">hier</a> betrachtet werden.
</p>
<p>
Da die Rohdaten in einem bin&auml;ren Format und au&szlig;erdem gepackt vorliegen, k&ouml;nnen wir uns den Inhalt nicht so ohne Weiteres ansehen. Zum Gl&uuml;ck haben wir aber auch hierf&uuml;r ein Tool :-) <br />
Mit
</p>
<pre>dayprogramfiletranslator raw</pre>
<p>
werden aus den bin&auml;ren Daten im Verzeichnis <em>raw</em> Textdateien erzeugt, die wir im Verzeichnis raw/txt &ouml;ffnen k&ouml;nnen um zu &uuml;berpr&uuml;fen, ob wir noch auf dem richtigen Weg sind...
</p>

<p class="note">
DayProgramFileTranslator ist f&uuml;r die TV-Daten-Aufbereitung nicht notwendig. Es dient nur dazu, die Daten, die in einem bin&auml;ren Format vorliegen, darzustellen.<br />
</p>


<h3>Schritt 2: Dateien f&uuml;r den Upload vorbereiten mit dem DataManager</h3>
<p>
Die Dateien k&ouml;nnen in dieser Form noch nicht verwendet werden. Der Grund
daf&uuml;r: TV-Browser ben&ouml;tigt f&uuml;r den Download noch weitere Informationen. Dazu
geh&ouml;ren u.a.:
</p>
<ul>
<li>eine Liste der Mirror-Server: alternative Server, die ebenfalls die Daten anbieten</li>
<li>eine Liste der Sender, die bereitgestellt werden</li>
<li>eine Versionierung der Tagesprogramme: bei Programm&auml;nderungen l&auml;dt TV-Browser n&auml;mlich nur die &Auml;nderungen herunter und arbeitet sie in seinen bestehenden Datenbestand ein.</li>
<li>Informationen &uuml;ber die Sender (Name, Zeitzone, Website usw.)</li>
</ul>

<p>
Damit sich TV-Browser auf dem Webservern zurecht findet, erstellt der
DataManager nun weitere Dateien.<br />
Vorher m&uuml;ssen wir den DataManager aber noch konfigurieren.<br />
</p>

<p>
Dazu wechseln wir in das Verzeichnis <em>config</em>.<br />
Dort befinden sich 3 Dateien:
</p>
<ul>
<li>myfirstgroup.txt</li>
<li>myfirstgroup_mirrorlist.txt</li>
<li>myfirstgroup_channellist.txt</li>
</ul>

<p>
Alle 3 Dateien lassen sich in einem Texteditor &ouml;ffnen und bearbeiten.
</p>
<p>
Beginnen wir mit der Datei <em>myfirstgroup.txt</em>: Sie enth&auml;lt den Namen und eine
Beschreibung unserer Gruppe - das Ganze sogar mehrsprachig. Wir k&ouml;nnen die
Texte (rechts vom '='-Zeichen) nach Belieben editieren.
</p>
<p class="note">
<em>myfirstgroup</em> ist der Name unserer Gruppe. Dieser Name ist in SimplePDS festgelegt und soll uns hier nicht weiter st&ouml;ren. In <a href="part2_de.html">Teil II</a> werden wir einen selber ausgew&auml;hlten Namen verwenden.
</p>

<p>
<em>myfirstgroup_channellist.txt</em> enth&auml;lt eine Liste aller Sender die angeboten werden sollen (genauer: die Sender, die zur Gruppe 'myfirstgroup' geh&ouml;ren). Diese Datei m&uuml;ssen wir nicht ver&auml;ndern. Sie enth&auml;lt bereits sinnvolle Testdaten.
</p>

<p>
<em>myfirstgroup_mirrorlist.txt</em> m&uuml;ssen wir unbedingt &auml;ndern. Sie enth&auml;lt eine Liste der Server, auf denen wir
die Daten unserer Sendergruppe ablegen. &Uuml;blicherweise sollte hier ein Eintrag
gen&uuml;gen. Will man die Daten auf mehreren Servern spiegeln, so mu&szlig; man in diese
Datei auch alle Mirror-Server eintragen. Wie gesagt, ein Eintrag gen&uuml;gt
erstmal.<br />
</p>
<p>
Der Inhalt der Datei <em>myfirstgroup_mirrorlist</em> kann z.B. so aussehen:
</p>
<pre>http://www.tvbrowser.org/tv-daten-test/
</pre>
<p>
Das Verzeichnis <em>tv-daten-test</em> mu&szlig; dazu nat&uuml;rlich auf dem Webspace existieren.<br />
Es ist unbedingt notwendig, auf dem Webserver ein eigenes Unterverzeichnis f&uuml;r die TV-Daten anzulegen. Das ist viel &uuml;bersichtlicher. Au&szlig;erdem wird sp&auml;ter automatisch eine Datei <em>index.html</em> erzeugt - und wir wollen ja keine existierenden Dateien &uuml;berschreiben ;-)<br />
</p>
<p class="note">
Jetzt ist ein guter Zeitpunkt, auf dem Webserver das Unterverzeichnis, in dem die TV-Daten abgelegt werden sollen, anzulegen.
</p>

<p>
Nachdem wir die beiden Dateien abgespeichert haben, k&ouml;nnen wir den DataManager
starten:
</p>
<pre>datamanager myfirstgroup</pre>

<p>
Der DataManager mu&szlig; wissen, f&uuml;r welche Sendergruppe(n) er die Daten aufbereitet. Wer mehrere Sendergruppen anbietet, kann alle Gruppen-IDs als Parameter &uuml;bergeben (mit einem Leerzeichen getrennt).
</p>

<p>
Ist der DataManager fertig, so finden wir im Verzeichnis <em>prepared</em> viele neue Dateien. Das sind jene, die wir sp&auml;ter auf
den Webserver laden werden. Um Bandbreite zu sparen, sind alle Dateien
komprimiert.
</p>

<p>
Was hat der DataManager genau gemacht?<br />
Der DataManager hat die Dateien aus dem "raw"-Verzeichnis gelesen und neue
Versionen davon im "prepared"-Verzeichnis erstellt. Zuvor hat er verglichen,
welche Dateien bereits im "prepared"-Verzeichnis existieren und - falls n&ouml;tig
- Dateien f&uuml;r Programm&auml;nderungen erstellt. Der DataManager arbeitet bei jedem
Durchlauf in diesem "prepared"-Verzeichnis.
</p>

<p class="note">
DIE DATEIEN IM PREPARED-VERZEICHNIS DUERFEN NIEMALS GELOESCHT WERDEN. Der DataManager ben&ouml;tigt die Dateien im prepared-Verzeichnis um daraus die Programm&auml;nderungen zu erstellen.<br />
L&ouml;scht man Dateien aus dem prepared-Verzeichnis, so stimmen die Daten nicht mehr mit denen zusammen, die der Benutzer bereits heruntergeladen hat. Folglich l&auml;dt TV-Browser keine Programm&auml;nderungen mehr f&uuml;r den entsprechenden Tag und Sender.
</p>


<p>
Damit ist alles f&uuml;r den dritten Schritt vorbereitet.
</p>

<h3>Schritt 3: Die Daten hochladen mit dem MirrorUpdater</h3>

<p>
Das dritte und letzte Tool - der MirrorUpdater - l&auml;dt nun die Dateien auf den
Webspace hoch. Vorher m&uuml;ssen wir den MirrorUpdater aber noch konfigurieren;
das machen wir, indem wir die Datei "mirrorupdater.ini" in einem Texteditor
&ouml;ffnen und anpassen.
Das .ini-File habe ich schon soweit angepa&szlig;t, da&szlig; nur noch die Zugangsdaten zum
FTP-Server angegeben werden m&uuml;ssen.
"url" ist dabei der FTP-Server, "path" ist das Verzeichnis, in das die
TV-Daten kopiert werden sollen (bitte unbedingt vorher h&auml;ndisch das
Unterverzeichnis am Webserver anlegen, der MirrorUpdater macht das nicht
automatisch).
Au&szlig;erdem braucht der MirrorUpdater nat&uuml;rlich Benutzername und Passwort f&uuml;r den
FTP-Zugang.
Die restlichen Zeilen m&uuml;ssen nicht ge&auml;ndert werden, trotzdem erl&auml;utere ich
kurz deren Bedeutung:
</p>
<table>
<tr>
<td><pre>dataSource.type=file</pre></td>
<td>Die Dateien werden vom lokalen Dateisystem gelesen
</tr>
<tr>
<td><pre>dataSource.dir=prepared</pre></td>
<td>Wir verwenden die Dateien vom Verzeichnis "prepared".<br />Der DataManager hat diese in Schritt 2 f&uuml;r uns erstellt.</td>
</tr>
<tr>
<td><pre>dataTarget.type=ftp</pre></td>
<td>Wir laden die Dateien auf einen FTP-Server.
</tr>
<tr>
<td><pre>groups=myfirstgroup</pre></td>
<td>Uns interessiert nur die Sendergruppe "myfirstgroup"</td>
</tr>
</table>

<p>
Nun starten wir den MirrorUpdater mit
</p>
<pre>mirrorupdater mirrorupdater.ini</pre>
<p>
Der MirrorUpdater erh&auml;lt als Parameter die Konfigurationsdatei, die wir eben
angepa&szlig;t haben.<br />
Nachdem der MirrorUpdater die Dateien erfolgreich hochgeladen hat, m&uuml;&szlig;ten die
TV-Daten nun eigentlich in TV-Browser sichtbar werden...
</p>


<h3>Schritt 4: Die neue Sendergruppe in TV-Browser aktivieren</h3>
<p>
Nachdem der MirrorUpdater seinen Dienst ohne Fehler beendet hat,
vergewissern wir uns, da&szlig; die Dateien auch wirklich auf dem Server sind.
</p>
<p>
In meinem Fall &ouml;ffne ich in meinem Webbrowser die URL http://www.tvbrowser.org/tv-daten-test/. Dort sollte nun eine Website sichtbar sein.
Au&szlig;erdem sieht man auf http://www.tvbrowser.org/tv-daten-test/myfirstgroup_info die von uns editierte Gruppen-Datei.
</p>

<p class="note">
Die angegebenen Websites existieren nat&uuml;rlich nicht. Die URLs sind an den eigenen Webspace anzupassen.
</p>

<p>
Anschlie&szlig;end &ouml;ffnen wir TV-Browser und f&uuml;gen die Sendergruppe hinzu:
Einstellungen --> TvDataServices --> TV-Browser --> Sendergruppen.<br />
Auf "hinzuf&uuml;gen" klicken und die URL zur Sendergruppe eingeben.
Wenn wir die TV-Daten zB. unter der URL
http://members.meinprovider.de/myhome/tvdata erwarten, geben wir:
http://members.meinprovider.de/myhome/tvdata/myfirstgroup ein.
</p>

<p>
Wenn alles geklappt hat, k&ouml;nnen wir nun die Senderliste aktualisieren und
sehen dort unsere neuen Sender!
</p>

<p class="note">
Fragen? Hat's doch nicht geklappt? Bei Problemen helfe ich gerne im <a href="http://hilfe.tvbrowser.org">Forum</a> weiter.
</p>

<p>
<table width="100%">
<tr>
<td><a href="index_de.html">Zur&uuml;ck zur &Uuml;bersicht</a></td>
<td align="right"><a href="part2_de.html">Weiter zu Teil II</a></td>
</tr>
</table>

</p>

	</body>
</html>
