<html>

<head>
  <title>TV-Browser</title>
  <link rel="stylesheet" type="text/css" href="style.css">
</head>

<body>

<h1>PROGRAMMDATEN F&Uuml;R TV-BROWSER ANBIETEN</h1>
<h2>unter Verwendung der TV-Browser-Tools</h2>
<h1>Teil III</h1>

<p>
<table>
<tr>
<td><strong>Autor:</strong></td>
<td>Til Schneider</td>
</tr>
</table>
</p>

<p>
Das ist Teil III des TV-Daten-anbieten-Tutorials. Es wird davon ausgegangen, da&szlig; Teil I und II erfolgreich durchgearbeitet worden sind. Wir werden wieder die selben Tools verwenden.
</p>
<p>
In Teil I wurde ein Java-Programm genutzt, um die TV-Daten von der eigentlichen Quelle einzusammeln (PrimaryDataService oder kurz PDS genannt).  In Teil II wurden die Daten von Hand eingegeben. Dieses Tutorial ist f&uuml;r diejenigen gedacht, die einen Datensammler schreiben wollen, jedoch in einer anderen Sprache als Java.
</p>
<p>
Die Aufbereitung mit einem Nicht-Java-Datensammler erfolgt in zwei Phasen:
<ol>
  <li>Der Datensammler erzeugt eine XML-Datei mit allen Programmdaten.</li>
  <li>Die XML-Datei wird mit Hilfe eines PDS, das diese Datei lesen kann, wie gewohnt verarbeitet.</li>
</ol>
</p>
<p>
Da wir mit einer bereits fertigen XML-Datei arbeiten und uns nur auf die zweite Phase konzentrieren, ist auch in diesem Teil - wie in den vorherigen - keine Programmierarbeit erforderlich.
</p>
<p>
Wie die XML-Datei erzeugt wird, ist allein Sache des Programmierers des Datensammlers. Zur Not kann die Datei auch von Hand erstellt werden. Aber wie gesagt: Es gibt bereits eine fertige Datei, die wir nutzen k&ouml;nnen.
</p>

<h3>Das eingesetzte XML-Format</h3>
<p>
Wenn ich bisher von <i>einer</i> XML-Datei gesprochen habe, so ist das nicht ganz richtig: Eigentlich handelt es sich um zwei XML-Dateien. In der einen, der <em>TvChannels.xml</em>, werden die Daten zu den Sendern abgelegt. In der zweiten, der <em>TvData.xml</em>, stehen dann die eigentlichen TV-Daten.
</p>
<p>
Als XML-Format wird <a href="http://membled.com/work/apps/xmltv" target="_blank">XMLTV</a> eingesetzt. An manchen Stellen, wo TV-Browser Informationen unterst&uuml;tzt, die in XMLTV kein &Auml;quivalent haben, wurde das Format etwas aufgebohrt. Diese Zusatzm&ouml;glichkeiten m&uuml;ssen jedoch nicht genutzt werden, so dass f&uuml;r die TV-Daten auch g&uuml;ltiges XMLTV genutzt werden kann.
</p>
<p>
Bei XMLTV werden die Daten &uuml;ber die Sender normalerweise in der selben Datei gespeichert, wie die eigentlichen TV-Daten. Dass die Daten bei uns getrennt werden, hat folgende Gr&uuml;nde:
<ul>
  <li>F&uuml;r die Senderdaten ben&ouml;tigt TV-Browser zwingend Informationen, die man mit XMLTV nicht darstellen kann (Copyright, Sendergruppe, usw.). Wenn man diese Daten in die <em>TvData.xml</em> packen w&uuml;rde, dann k&ouml;nnte man diese nicht mehr in g&uuml;ltigem XMLTV erstellen.</li>
  <li>Die Senderdaten sind statisch, die TV-Daten sind dynamisch. D.h. man kann die <em>TvChannels.xml</em> einmal von Hand erstellen, so dass man nur noch die <em>TvData.xml</em> automatisch erstellen muss. Da der Datensammler keine Senderdaten mehr generieren muss, ist er einfacher zu schreiben.</li>
  <li>Da das Auslesen in zwei Schritten getrennt passiert, ist die Aufbereitung schneller, wenn die Daten in getrennten Dateien sind.</li>
</ul>
</p>

<h3>Die Datei <em>TvChannels.xml</em></h3>
<p>
Wie bereits gesagt, ben&ouml;tigt TV-Browser bei den Senderdaten Informationen, die man mit XMLTV nicht darstellen kann. Das Format der <em>TvChannels.xml</em> ist daher zwar an XMLTV angeleht, jedoch kein g&uuml;ltiges XMLTV mehr.
</p>
<p>
Jetzt aber mal genug von diesem theoretischen Geschwafel! Jetzt wollen wir mal zur Tat schreiten. Wir &ouml;ffnen zun&auml;chst einmal die Datei <em>TvChannels.xml</em> in einem Texteditor wie z.B. Notepad. Dort tragen wir alle Sender ein, die mit Hilfe unseres Datensammlers versorgt werden.
</p>
<p>
Die Eintr&auml;ge dieser Datei entsprechen der Zeile 2 in der Excel-Datei aus Teil II. Damit man sich leichter zurecht findet, sind hier schon zwei Beispielsender zu sehen. Beim ersten Sender steht vor jedem Tag ein Beschreibungskommentar.
</p>
<p>
Die einzelnen Eintr&auml;ge (Details siehe <a href="teil2.html#channelTable" target="_blank">Tabelle aus Teil II</a>):
<ul>
  <li><b>Attribut <em>id</em></b> (Channel ID): Diese ID wird sowohl von TV-Browser, als auch sp&auml;ter in der <em>TvData.xml</em> verwendet und darf nur alphanumerische Zeichen enthalten.</li>
  <li><b>Tag <em>&lt;name&gt;</em></b> (Channel Name): Der Name des Senders, wie er in TV-Browser angezeigt wird.</li>
  <li><b>Tag <em>&lt;group&gt;</em></b> (Channel Group ID): Die ID der Sendergruppe, zu der dieser Sender geh&ouml;ren soll.</li>
  <li><b>Tag <em>&lt;time-zone&gt;</em></b> (Time Zone): Die Zeitzone, auf die sich die Zeiten der Programmdaten beziehen.</li>
  <li><b>Tag <em>&lt;country&gt;</em></b> (Country Code): Das Land in dem der Sender sendet.</li>
  <li><b>Tag <em>&lt;copyright&gt;</em></b> (Copyright Message): Der Text, der in der Senderspalte ganz unten erscheint.</li>
  <li><b>Tag <em>&lt;url&gt;</em></b> (Copyright Website): Die Webseite des Senders.</li>
</ul>
</p>

<h3>Die Datei <em>TvData.xml</em></h3>
<p>
Das ist die Datei, die vom Datensammler automatisch erstellt werden soll. Hier werden alle Programmdaten abgelegt.
</p>
<p>
Wir &ouml;ffnen nun die Datei <em>TvData.xml</em> in einem Texteditor. Diese Datei enth&auml;lt f&uuml;r jede Sendung ein <em>&lt;programme&gt;</em>-Tag. In welcher Reihenfolge diese Tags in der Datei stehen ist dabei vollkommen egal.
</p>
<p>
Das erste Beispieltag hat wieder vor jedem Tag einen Beschreibungskommentar. Dieses erste Tag zeigt alle Informationen, die man zu einer Sendung angeben kann. Aber keine Angst: So viel muss man nicht angeben, aber man kann es. Alles was man auf jeden Fall angeben muss, ist in der Beschreibung mit einem <em>(required)</em> gekennzeichnet. Das ist die Channel-ID, die Startzeit und der Titel der Sendung.
</p>
<p>
Ein minimales Sendungs-Tag sieht daher z.B. so aus:
<pre>
&lt;programme channel="<b>test24</b>" start="<b>200407101100</b>"&gt;
  &lt;title&gt;<b>Nachrichten</b>&lt;/title&gt;
&lt;/programme&gt;
</pre>
</p>
<p>
Alle Zeiten werden in XMLTV nach dem folgenden Schema angegeben:
<ul>
  <li>Jahr (4 Ziffern)</li>
  <li>Monat (2 Ziffern)</li>
  <li>Tag (2 Ziffern)</li>
  <li>Stunden (2 Ziffern)</li>
  <li>Minuten (2 Ziffern)</li>
</ul>
</p>
<p>
<em>200407101100</em> bedeutet daher: 10. Juli 2004 um 11:00 Uhr.
</p>
<p>
Momentan sind noch sehr wenige Sendungen eingetragen. Also ruhig noch ein paar mehr dazuschreiben, damit nachher ein Bi&szlig;chen mehr zu sehen ist. Dabei muss darauf geachtet werden, dass die verwendeten Channel-IDs auch in der <em>TvChannels.xml</em> definiert wurden!
</p>
<p>
Wenn genug Datenmaterial zusammen ist, speichern wir die Datei ab. Auch die &Auml;nderungen in der <em>TvChannels.xml</em> m&uuml;ssen gespeichert werden.
</p>
<p>
Jetzt k&ouml;nnen wir einen ersten Probelauf wagen. Wir starten also wie auch in Teil I und II den PDSRunner mit
</p>
<pre>
pdsrunner XmlTvPDS
</pre>
<p>
Wie gewohnt finden wir eventuelle Fehlermeldungen im Verzeichnis <em>pdslog</em>. Wenn alles funktioniert hat liegen die Rohdaten im Verzeichnis <em>raw</em>. Jetzt m&uuml;ssen die Daten nur noch vom DataManager aufbereitet und vom MirrorUpdater hochgeladen werden. Diese m&uuml;ssen jedoch wieder zuerst konfiguriert werden. Das wird genauso gemacht, wie in Teil II im Abschnitt <a href="teil2.html#configuration" target="_blank">Konfiguration von DataManager und MirrorUpdater</a> beschrieben. Statt dem ExcelPDS muss nat&uuml;rlich das XmlTvPDS verwendet werden.
</p>

<h3>Regelm&auml;&szlig;e Aktualisierung</h3>
<p>
Wie immer m&uuml;ssen die Daten auf dem Server regelm&auml;&szlig;ig aktualisiert werden. Dazu m&uuml;ssen wir bei jeder Aktualisierung zuerst den Datensammler ausf&uuml;hren, der die neue <em>TvData.xml</em> erstellt. Danach werden die TV-Daten-Tools ausgef&uuml;hrt:
</p>
<pre>
pdsrunner XmlTvPDS
datamanager XmlTvPDS
mirrorupdater mirrorupdater.ini
</pre>
<p class="note">
<strong>Wichtig:</strong> Damit verhindert wird, da&szlig; TV-Browser auf Server zugreift, deren TV-Daten veraltet sind, wird auf jedem Server eine Datei mit dem Namen <em>lastupdate</em> gespeichert (dies &uuml;bernimmt der MirrorUpdater f&uuml;r uns).<br />
TV-Browser l&auml;dt keine Daten von Servern, die l&auml;nger als 5 Tage keine neuen Daten erhalten haben. Ein Daten-Anbieter mu&szlig; also mindestens alle 5 Tage aktualisieren.
</p>

<p>Der DataManager ben&ouml;tigt die Dateien im prepared-Verzeichnis um daraus die Programm&auml;nderungen zu erstellen. Daher d&uuml;rfen die Dateien im prepared-Verzeichnis niemals gel&ouml;scht werden.<br />
L&ouml;scht man Dateien aus dem prepared-Verzeichnis, so stimmen die Daten nicht mehr mit denen zusammen, die der Benutzer bereits heruntergeladen hat. Folglich l&auml;dt TV-Browser keine Programm&auml;nderungen mehr f&uuml;r den entsprechenden Tag und Sender.
</p>




<p>
<table width="100%">
<tr>
<td align="left"><a href="teil2.html">Zur&uuml;ck zu Teil II</a></td>
<td align="center"><a href="index.html">&Uuml;bersicht</a></td>
<td align="right"><!-- <a href="teil4.html">Weiter zu Teil IV</a> --></td>
</tr>
</table>

</p>

</body>
</html>
