#Saved by i18n Plugin Version 2.7.0.0
#Sat Oct 24 13:32:05 CEST 2009
ConfigAssistant.button.1=Luk assistent
ConfigAssistant.button.2=Forts\u00E6t konfiguration
ConfigAssistant.cancelDlg=Den grundl\u00E6ggende konfiguration er ikke f\u00E6rdiggjort.\nHvordan \u00F8nsker du at forts\u00E6tte?\n\nDu kan genstarte denne assistent ved at v\u00E6lge Hj\u00E6lp -> K\u00F8r indstillings-assistenten.
ConfigAssistant.cancelDlg.title=Luk assistent
ConfigAssistant.finish=F\u00E6rdig
ConfigAssistant.notShowAgain=Vis ikke assistenten igen.
ConfigAssistant.title=Indstillings-assistent
FinishCardPanel.description=<h2>Tillykke\!</h2>\nDu har succesfuldt konfigureret TV-Browser. S\u00E5 snart som du klikker p\u00E5 "F\u00E6rdig" vil indstillings-assistente blive lukket.<br><br>\n<b>Hvordan forts\u00E6tter jeg?</b><br><br>\nVi foresl\u00E5r at du tager et hurtigt kig p\u00E5 online <a href\="http\://enwiki.tvbrowser.org">brugerguiden</a>. Der finder du vigtige <b>tips og tricks</b> som kan hj\u00E6lpe dig med at bruge TV-Browser.<br><br>\nHvis du har <b>problemer eller sp\u00F8rgsm\u00E5l</b> kan du finde hj\u00E6lp p\u00E5 vores <a href\="http\://hilfe.tvbrowser.org">forum</a>. <br><br><br><br>\nVi h\u00E5ber at du vil <b>nyde TV-Browser</b>\!
NetworkCardPanel.auth=Godkendelse p\u00E5 proxy serveren er kr\u00E6vet\:
NetworkCardPanel.closing=<html>\nHvis du <b>st\u00F8der p\u00E5 problemer</b> kan du pr\u00F8ve at f\u00E5 hj\u00E6lp p\u00E5 <a href\="http\://hilfe.tvbrowser.org">vores forum</a> (du beh\u00F8ver en internet forbindelse til dette)\n<br><br>\nKlik venligst p\u00E5 "N\u00E6ste" n\u00E5r du tror at TV-Browser har forbindelse til internettet\!\n</html>
NetworkCardPanel.connectionError=<html>\n<b>Der kunne ikke oprettes forbnindelse til internettet\!</b><br><br>\nTV-Browser kunne ikke forbinde til internettet.<br>\nDette er n\u00F8dvendigt for installationen, fordi alle informationer om kanaler<br>\nog udsendelser kun er tilg\u00E6ngelige online.<br><br>\n<b>Hvis du bruger en firewall\:</b><br><br>\nKontroller at firewallens indstillinger tillader <b>TV-Browser</b> at <b>forbinde til<br>\ninternettet</b>. Du kan finde information om <b>indstillinger</b> for de mest popul\u00E6re<br>\ffirewalls p\u00E5 <a href\="http\://enwiki.tvbrowser.org/index.php/Firewalls">vores hjemmeside</a>. Kontroller venligst at internet-forbindelsen virker korrekt.<br>\nDu kan f\u00E5 <b>hj\u00E6lp</b> p\u00E5 vores <a href\="http\://hilfe.tvbrowser.org">online forum</a> eller fra din netv\u00E6rks-administrator\n</html>
NetworkCardPanel.host=V\u00E6rt
NetworkCardPanel.myProxy=Min HTTP-Proxy\:
NetworkCardPanel.password=Password
NetworkCardPanel.port=Port
NetworkCardPanel.preambel=TV-Browser vil pr\u00F8ve at <b>oprette forbindelse til internettet</b> n\u00E5r du trykker <i>N\u00E6ste</i>. Dette kan tage op til 30 sekunder.<br><br>\nForbindelsen til internetter er vigtig. Uden den, kan TV-Browser ikke downloade tv-lister.<br><br><b>V\u00E6r venligst sikker p\u00E5 at din computer har forbindelse til internettet f\u00F8r du klikker <i>N\u00E6ste</i>.</b><br>Hvis du bruger en <a href\="http\://enwiki.tvbrowser.org/index.php/Firewalls">firewall</a>, f\u00E5 konfigurer den venligst tilsvarende.
NetworkCardPanel.user=Bruger
NetworkCardPanel.usingProxy=<html>Jeg anvender en proxy server til at forbinde til internettet<br>(Hvis du ikke ved hvad en proxy er, s\u00E5 har du ikke brug for en)</html>
NetworkSuccessPanel.success=<h2>Netv\u00E6rk testet med succes\!</h2>\nTV-Browser var i stand til at forbinde til internettet <b>med succes</b><br><br>\nI n\u00E6ste trin vil TV-Browser samle en liste over alle <b>tilg\u00E6ngelige kanaler</b>.<br><br><br><br>\nVenligst klik p\u00E5 <i>N\u00E6ste</i>for at hente kanal listen.
PictureConfigPanel.allPictures=Download billeder for alle udsendelser
PictureConfigPanel.closing=<html><span style\="color\:red">BEM\u00C6RK\: </span>Billeder er ikke tilg\u00E6ngelige for alle kanaler. S\u00E5 det er <b>ikke en fejl</b> hvis kanaler <b>ikke viser billeder</b>.<br><br><br><br>Klik venligst p\u00E5 "N\u00E6ste" for at forts\u00E6tte.\n</html>
PictureConfigPanel.closingUpdate=<html><span style\="color\:red">BEM\u00C6RK\: </span>Billeder er ikke tilg\u00E6ngelige for alle kanaler. S\u00E5 det er <b>ikke en fejl</b> hvis kanaler <b>ikke viser billeder</b>.<br><br><br><br>Klik venligst p\u00E5 "OK" for at forts\u00E6tte.\n</html>
PictureConfigPanel.eveningPictures=Download kun billeder for aften-udsendelser
PictureConfigPanel.morningPictures=Download kun billeder for nat og dag-udsendelser
PictureConfigPanel.noPictures=Download ikke billeder
PictureConfigPanel.pictureSettings=Billede indstillinger
PictureConfigPanel.preambel=Her kan du v\u00E6lge hvorvidt billederne skal downloades s\u00E5fremt kanalen underst\u00F8tter billeder.<br><br>Denne indstilling <b>p\u00E5virker kun downloadningen</b>, s\u00E5fremt billederne rent faktisk er vist i en komponent, og kan indstilles seperat.<br><br>I udsendelses-oversigten vil billederne blive vist for de udsendelser som er i tidsrummet fra 6\:00 til 23\:00 som standard.<br><br>Selvf\u00F8lgelig kan billederne <b>kun</b> vises, s\u00E5fremt udsendelses-data indeholder et billede.
PictureConfigPanel.preambelUpdate=Denne version af TV-Browser <b>underst\u00F8tter visning af billeder</b>. Versionen du har brugt indtil nu underst\u00F8ttede ikke billeder, derfor er du n\u00F8dt til at foretage nogle indstillinger ang\u00E5ende billeder.<br><br> 
StatusPanel.channel=V\u00E6lg kanaler
StatusPanel.done=F\u00E6rdig
StatusPanel.network=Netv\u00E6rk
StatusPanel.title=Trin {0} af {1}\: {2}
SubscribeChannelCardPanel.noChannelsSelected=Du har ikke valgt nogle kanaler til download.\nV\u00E6lg venligst dine favorit kanaler og flyt dem til boksen i h\u00F8jre side.
SubscribeChannelCardPanel.noChannelsSelected.Title=Ingen kanaler valgt
TvBrowserPictureSettingsUpdateDialog.accept=Ja, jeg \u00F8nsker ikke billeder
TvBrowserPictureSettingsUpdateDialog.back=Tilbage til indstillinger
TvBrowserPictureSettingsUpdateDialog.text=<html><span style\="color\:red">BEM\u00C6RK\: </span>Downloadning af billeder er sl\u00E5et fra\!<br><br>Er du sikker p\u00E5 at du ikke \u00F8nsker at downloade billeder.</html>
TvBrowserPictureSettingsUpdateDialog.warning=Advarsel
TvBrowserUpdateAssistant.chooseDirectory=V\u00E6lg TV liste mappe...
TvBrowserUpdateAssistant.error.1=Ugyldig mappe - Du har valgt den aktuelle TV liste mappe.
TvBrowserUpdateAssistant.error.2=Den valgte mappe indeholder ingen gyldige TV-oversigter.
TvBrowserUpdateAssistant.error.2.title=Ugyldig sti
TvBrowserUpdateAssistant.error.3=Kunne ikke importere TV-oversigter\!
TvBrowserUpdateAssistant.error.msg.1=Den valgte mappe indeholder ingen TV-oversigter.
TvBrowserUpdateAssistant.error.msg.2=V\u00E6lg venligst TV liste mappen.
TvBrowserUpdateAssistant.error.title.1=Ugyldig mappe
TvBrowserUpdateAssistant.explain=Hvis du \u00F8nsker at importere eksisterende TV-oversigter og kanal-indstillinger til TV-Browser {0}, s\u00E5 klik p\u00E5 knappen nedenunder og v\u00E6lg den mappe som indeholder oversigterne ('tvdata' i din TV-Browser mappe).
TvBrowserUpdateAssistant.import=Importer
TvBrowserUpdateAssistant.importStatus={0} kanaler klar til import.
TvBrowserUpdateAssistant.option.1=Fortryd indstillinger
TvBrowserUpdateAssistant.question.1={0} kanaler klar til import.\nStart import?
TvBrowserUpdateAssistant.question.1.title=Importer
TvBrowserUpdateAssistant.question.2=Du har ikke valgt en TV liste mappe for import.\nEr du sikker p\u00E5 at du \u00F8nsker at kassere dine kanal indstillinger?
TvBrowserUpdateAssistant.startTVBrowser=Start TV-Browser
TvBrowserUpdateAssistant.status.1=Importerer TV-oversigter...
TvBrowserUpdateAssistant.status.2={0} kanaler importeret med succes.
TvBrowserUpdateAssistant.updateTo=Opdater til TV-Browser {0}
TvBrowserUpdateAssistant.welcome=Velkommen til TV-Browser {0}\!
WelcomeCardPanel.welcome=<HTML><h1>Velkommen til TV-Browser&nbsp;{0}\!</h1><br>F\u00F8r du kan anvende TV-Browser er der nogle indstillinger der skal foretages.<br><br>Klik p\u00E5 <i>N\u00E6ste</i> knappen for at forts\u00E6tte, eller <i>Annuller</i> s\u00E5fremt du \u00F8nsker at konfigurere TV-Browser uden hj\u00E6lp fra assistenten.<br><br>\nDu kan starte assistenten ved at v\u00E6lge <i>Hj\u00E6lp -&gt; Indstillings-assistent</i>.<br><br><br><br>Du kan finde mere hj\u00E6lp vedr\u00F8rende indstillings-assistenten i <a href\="http\://enwiki.tvbrowser.org/index.php/Install">online manual</a>.</HTML>
