
ConfigAssistant.back            = F\u00F6reg\u00E5ende
ConfigAssistant.button.1        = St\u00E4ng guiden
ConfigAssistant.button.2        = Forts\u00E4tt
ConfigAssistant.cancel          = Avbryt
ConfigAssistant.cancelDlg       = F\u00F6rsta inst\u00E4llningarna har inte avslutats.\n\nHur vill du forts\u00E4tta?\n
ConfigAssistant.cancelDlg.title = St\u00E4ng guiden
ConfigAssistant.finish          = Avsluta
ConfigAssistant.next            = N\u00E4sta
ConfigAssistant.notShowAgain    = Visa inte guiden igen.
ConfigAssistant.title           = Inst\u00E4llningsguide

FinishCardPanel.description = <h2>Grattis!</h2>\nDu har konfigurerat TV-browser <b>riktigt</b> och <b>fullst\u00E4ndigt</b>. N\u00E4r du klickar p\u00E5 "Avsluta" st\u00E4ngs inst\u00E4llningsguiden.<br><br>\n<b>Hur forts\u00E4tter man?</b><br><br>\nVi f\u00F6resl\u00E5r att du tittar p\u00E5 <a href="http://enwiki.tvbrowser.org">online anv\u00E4ndarhanledningen</a>. D\u00E4r hittar du viktiga <b>tips och tricks</b> som kan hj\u00E4lpa dig att anv\u00E4nda TV-Browser programmet<br><br>\nOm du f\u00E5r <b>problem eller fr\u00E5gor</b> kan du f\u00E5 hj\u00E4lp i v\u00E5rat <a href="http://hilfe.tvbrowser.org">forum</a>. <br><br>\nVi hoppas du f\u00E5r stor anv\u00E4nding av <b>TV-Browser</b>!

NetworkCardPanel.auth            = Inloggning till proxyserver beh\u00F6vs:
NetworkCardPanel.closing         = \nOm du f\u00E5r problem, kan du s\u00F6ka efter hj\u00E4lp i v\u00E5rat <a href="http://hilfe.tvbrowser.org">online forum</a> (Du beh\u00F6ver ha en aktiv internetkoppling f\u00F6r detta)\n<br><br>\nKlicka p\u00E5 <b><i>N\u00E4sta</i></b> n\u00E4r du anser att TV-Browser kan ansluta till internet!\n
NetworkCardPanel.connectionError = <html>\n<b>Koppling till internet kunde inte uppr\u00E4ttas!</b><br><br>\nTV-Browser kunde inte koppla sig till internet..<br>\nDetta beh\u00F6vs f\u00F6r installationen, eftersom information om kanaler<br>\noch program \u00E4r endast tillg\u00E4ngliga "online".<br><br>\n<b>Om du anv\u00E4nder en brandv\u00E4gg:</b><br><br>\nF\u00F6rs\u00E4kra dig om att brandv\u00E4ggen till\u00E5ter <b>TV-Browser</b> att ansluta till <br>\ninternet. Du hittar mer information om inst\u00E4llningar f\u00F6r de mest popul\u00E4ra<br>\nbrandv\u00E4ggarna p\u00E5 <a href="http://enwiki.tvbrowser.org/index.php/Firewalls">v\u00E5r hemsida</a>. V\u00E4nligen f\u00F6rs\u00E4kra dig om att din koppling till internet fungerar utan problem.<br>\nDu kan f\u00E5 hj\u00E4lp i v\u00E5rt <a href="http://hilfe.tvbrowser.org">online Forum</a> eller fr\u00E5n din n\u00E4tverksadministrat\u00F6r\n</html>
NetworkCardPanel.error           = Fel
NetworkCardPanel.host            = V\u00E4rd-dator
NetworkCardPanel.myProxy         = Min HTTP-Proxy:
NetworkCardPanel.password        = L\u00F6senord
NetworkCardPanel.port            = Port
NetworkCardPanel.preambel        = <html>TV-Browser f\u00F6rs\u00F6ker att <b>ansluta sig till internet</b> i n\u00E4sta steg. Detta kan ta upp till 30 sekunder.<br><br>\nAnslutningen till internet \u00E4r viktig. Utan anslutning \u00E4r det inte m\u00F6jligt att h\u00E4mta kanal- och program-information.<br><br>Om du m\u00E5ste ansluta dig till internet manuellt, m\u00E5ste du g\u00F6ra det <b>innan</b> du klickar p\u00E5 "N\u00E4sta". Om du anv\u00E4nder en <a href="http://enwiki.tvbrowser.org/index.php/Firewalls">brandv\u00E4gg</a>, kan det vara n\u00F6dv\u00E4ndigt med extra inst\u00E4llningar i brandv\u00E4ggen.</html>
NetworkCardPanel.user            = Anv\u00E4ndarnamn
NetworkCardPanel.usingProxy      = <html>Jag anv\u00E4nder en proxy-server f\u00F6r att koppla mig till internet<br>(Om du inte vet vad en proxy \u00E4r, beh\u00F6ver du troligtvis ingen)</html>

NetworkSuccessPanel.success = <h2>N\u00E4tverkstestet lyckades!</h2>TV-Browser har lyckats ansluta sig till internet<br><br>\nI n\u00E4sta steg h\u00E4mtar TV-browser en lista p\u00E5 alla <b>tillg\u00E4ngliga kanaler</b>.<br><br>\nKlicka p\u00E5 <b><i>N\u00E4sta</i></b> f\u00F6r att h\u00E4mta kanallistan.

PictureConfigPanel.allPictures     = Ladda ner bilder f\u00F6r alla program
PictureConfigPanel.closing         = <html><span style="color:red">Uppm\u00E4rksamma: </span>Bilder finns inte tillg\u00E4ngliga f\u00F6r alla kanaler. S\u00E5 det \u00E4r <b>ingen bug</b> ifall kanalen <b>inte visar bilder</b>.<br><br><br><br>Var god tryck "N\u00E4sta" f\u00F6r att forts\u00E4tta.\n</html>
PictureConfigPanel.closingUpdate   = <html><span style="color:red">Uppm\u00E4rksamma: </span>Bilder finns inte tillg\u00E4ngliga f\u00F6r alla kanaler. S\u00E5 det \u00E4r <b>ingen bug</b> ifall kanalen <b>inte visar bilder</b>.<br><br><br><br>Var god tryck "OK" f\u00F6r att forts\u00E4tta.\n</html>
PictureConfigPanel.eveningPictures = Ladda bara ner bilder f\u00F6r kv\u00E4llsprogram
PictureConfigPanel.morningPictures = Ladda bara ner bilder f\u00F6r natt och dag-program
PictureConfigPanel.noPictures      = Ladda inte ner bilder
PictureConfigPanel.pictureSettings = Bildinst\u00E4llningar
PictureConfigPanel.preambel        = H\u00E4r kan du markera ifall du vill att programmet skall ladda ner bilder ifr\u00E5n kanalen, ifall kanalen har st\u00F6d f\u00F6r detta<br><br>Denna inst\u00E4llning <b>p\u00E5verkar bara nedladdningen</b>, ifall bilden verkligen kan visas i en komponent<br><br>I programtabl\u00E5n kommer bilder att visas f\u00F6r program som \u00E4r inom tidsgr\u00E4nsen fr\u00E5n 18:00 ttill 23:00 som standard.
PictureConfigPanel.preambelUpdate  = Denna version av TV-Browser <b>har st\u00F6d f\u00F6r att visa bilder</b>. Versionen du anv\u00E4nt fram tills nu hade inte st\u00F6d f\u00F6r detta. D\u00E4rf\u00F6r m\u00E5ste du st\u00E4lla in lite inst\u00E4llningar f\u00F6r detta.<br><br> 

StatusPanel.channel = V\u00E4lj kanal
StatusPanel.done    = Klar
StatusPanel.network = N\u00E4tverk
StatusPanel.title   = Steg {0} av {1}: {2}

SubscribeChannelCardPanel.noChannelsSelected       = Du har inte valt n\u00E5gra kanaler.\nMarkera dina favoritkanaler och f\u00F6r \u00F6ver dem till den h\u00F6gra rutan.
SubscribeChannelCardPanel.noChannelsSelected.Title = Inga kanaler valda.

TvBrowserPictureSettingsUpdateDialog.accept  = Ja. Jag vill inte har bilder
TvBrowserPictureSettingsUpdateDialog.back    = Tillbaka till inst\u00E4llningar
TvBrowserPictureSettingsUpdateDialog.text    = <html><span style="color:red">Uppm\u00E4rksamma: </span>Nedlanddning av bilder \u00E4r avaktiverat<br><br>\u00C4r du s\u00E4ker p\u00E5 att du inte vill ladda ner bilder?</html>
TvBrowserPictureSettingsUpdateDialog.warning = Varning

WelcomeCardPanel.welcome = <html><h1>V\u00E4lkommen till TV-Browser&nbsp;{0}!</h1>Innan du kan anv\u00E4nda TV-Browser m\u00E5ste vissa inst\u00E4llningar g\u00F6ras.<br><br>\nKlicka p\u00E5 knappen <b><i>N\u00E4sta</i></b> f\u00F6r att forts\u00E4tta, eller <b><i>Avbryt</i></b> om du vill g\u00F6ra inst\u00E4llningarna utan denna guide.<br><br>\nDu kan starta denna guide igen fr\u00E5n menyn <b><i>Hj\u00E4lp -&gt; K\u00F6r inst\u00E4llningsguiden</i></b>.<br><br>\nMer information finns i <a href="http://enwiki.tvbrowser.org/index.php/Install">online dokumentationen</a>.</html>
