
ConfigAssistant.button.1        = Assistent schlie\u00DFen
ConfigAssistant.button.2        = Konfiguration fortsetzen
ConfigAssistant.cancelDlg       = Der Konfigurationsvorgang ist noch nicht abgeschlossen.\nWie wollen Sie fortfahren?\n\nSie k\u00F6nnen den Assistenten unter Hilfe -> Einrichtungs-Assistent \njederzeit wieder aufrufen.
ConfigAssistant.cancelDlg.title = Assistent schlie\u00DFen
ConfigAssistant.finish          = Fertig
ConfigAssistant.notShowAgain    = Assistent nicht wieder anzeigen.
ConfigAssistant.title           = TV-Browser einrichten

FinishCardPanel.description = <h2>Herzlichen Gl\u00FCckwunsch!</h2>\nSie haben TV-Browser erfolgreich konfiguriert. Klicken Sie auf <i>Fertig</i> um den Einrichtungs-Assistenten zu beenden.<br><br>\nWie geht es weiter?<br><br>\nWir empfehlen Ihnen, einen Blick in unser <a href="http://wiki.tvbrowser.org">online Handbuch</a> zu werfen. Dort finden Sie <b>wertvolle Tipps und Tricks</b> zum Umgang mit dem TV-Browser.<br><br>\nBei <b>Problemen und Fragen</b> finden Sie Hilfe in unserem <a href="http://hilfe.tvbrowser.org">Forum</a>. Dort k\u00F6nnen Sie auch Anregungen f\u00FCr die Verbesserung des TV-Browsers hinterlassen.<br><br><br><br>\nWir w\u00FCnschen Ihnen viel Spa\u00DF und ein besseres Fernsehen mit dem TV-Browser!

NetworkCardPanel.auth            = Authentifizierung am Proxy-Server notwendig:
NetworkCardPanel.closing         = <html>\n<b>Bei Problemen</b> k\u00F6nnen Sie versuchen <a href="http://hilfe.tvbrowser.org">im Forum</a> Hilfe zu erhalten (hierf\u00FCr ben\u00F6tigen Sie einen Internetzugang!)<br><br>\nBitte klicken Sie auf <i>Weiter</i> sobald Sie meinen, dass TV-Browser auf das Internet zugreifen kann!\n</html>
NetworkCardPanel.connectionError = <html>\n<b>Internetverbindung konnte nicht hergestellt werden!</b><br><br>\nTV-Browser konnte sich nicht erfolgreich mit dem Internet verbinden.<br>\nDies ist f\u00FCr die weitere Installation jedoch zwingend notwendig, da alle <br>\nInformationen zu den Sendern und Sendungen nur online vorhanden sind.<br><br>\n<b>Wenn Sie eine Firewall benutzen:</b><br><br>\nStellen Sie bitte Ihre Firewall so ein, dass der <b>TV-Browser</b> <b>Zugriff auf das<br>\nInternet</b> hat. Sie finden Informationen zu den <b>Einstellungen</b> der g\u00E4ngigsten<br>\nFirewalls auf <a href="http://wiki.tvbrowser.org/firewalls">unserer Homepage</a>. <br><br>\nBitte stellen Sie sicher, dass die Online-Verbindung funktioniert und holen Sie<br>\nsich ggf. <b>Hilfe</b> im TV-Browser <a href="http://hilfe.tvbrowser.org">Online-Forum</a> oder bei Ihrem<br>\nNetzwerkadministrator.\n</html>
NetworkCardPanel.host            = Host
NetworkCardPanel.myProxy         = Mein HTTP-Proxy:
NetworkCardPanel.password        = Passwort
NetworkCardPanel.port            = Port
NetworkCardPanel.preambel        = Im n\u00E4chsten Schritt wird TV-Browser versuchen, <b>auf das Internet zuzugreifen</b>. Dies kann bis zu 30 Sekunden dauern. Die Verbindung ins Internet ist notwendig, um die Sender- und Sendungsinformationen herunterzuladen.<br><br>\n<b>Ohne Internetzugang geht es leider nicht!</b> Falls Sie die Internetverbindung manuell herstellen m\u00FCssen, so machen Sie dies bitte bevor Sie auf <i>Weiter</i> klicken. Stellen Sie ggf. Ihre <a href="http://wiki.tvbrowser.org/Firewalls">Firewall</a> so ein, dass TV-Browser auf das Internet zugreifen kann.
NetworkCardPanel.user            = Benutzer
NetworkCardPanel.usingProxy      = <html>Ich benutze einen Proxy-Server um mich mit dem Internet zu verbinden<br>(Wenn Sie nicht wissen, was ein Proxy ist, dann ben\u00F6tigen Sie vermutlich keinen)</html>

NetworkSuccessPanel.success = <h2>Netzwerk eingerichtet!</h2>\nTV-Browser hat sich <b>erfolgreich</b> mit dem Internet verbunden!<br><br>Im n\u00E4chsten Schritt wird TV-Browser die Liste der aktuell <b>verf\u00FCgbaren Sender herunterladen</b>.<br><br><br><br>\nBitte klicken Sie auf <i>Weiter</i>, damit TV-Browser jetzt die Senderliste herunterladen kann.

PictureConfigPanel.allPictures     = Bilder f\u00FCr alle Sendungen herunterladen
PictureConfigPanel.closing         = <html><span style="color:red">ACHTUNG: </span>Es stehen nicht f\u00FCr alle Sender Bilder zur Verf\u00FCgung. Es ist also <b>kein Fehler</b>, wenn <b>Sender keine Bilder</b> anzeigen.<br><br><br><br>Bitte klicken Sie auf <i>Weiter</i>, sobald Sie die gew\u00FCnschte Einstellung ausgew\u00E4hlt haben!</html>
PictureConfigPanel.closingUpdate   = <html><span style="color:red">ACHTUNG: </span>Es stehen nicht f\u00FCr alle Sender Bilder zur Verf\u00FCgung. Es ist also <b>kein Fehler</b>, wenn <b>Sender keine Bilder</b> anzeigen.<br><br><br><br>Bitte klicken Sie auf <i>OK</i>, sobald Sie die gew\u00FCnschte Einstellung ausgew\u00E4hlt haben!</html>
PictureConfigPanel.eveningPictures = Nur die Bilder des Abendprogramms herunterladen (16 Uhr bis 0 Uhr)
PictureConfigPanel.morningPictures = Nur die Bilder des Tagesprogramms herunterladen (0 Uhr bis 16 Uhr)
PictureConfigPanel.noPictures      = Bilder nicht herunterladen
PictureConfigPanel.pictureSettings = Bildereinstellung
PictureConfigPanel.preambel        = Hier k\u00F6nnen Sie ausw\u00E4hlen, ob Sie Bilder herunterladen m\u00F6chten, wenn diese f\u00FCr einen Sender zur Verf\u00FCgung stehen. Diese Einstellung betrifft <b>nur das Herunterladen</b>, ob die Bilder angezeigt werden, kann f\u00FCr jede Komponente, die Bilder anzeigen kann, separat eingestellt werden.<br><br>In der Programmtabelle werden standardm\u00E4\u00DFig die Bilder zu Sendungen angezeigt, die zwischen 18 und 23 Uhr liegen.
PictureConfigPanel.preambelUpdate  = Diese Version von TV-Browser <b>unterst\u00FCtzt die Anzeige von Bildern</b>. Da die Version, die Sie bisher verwendet haben, dies noch nicht unterst\u00FCtzte, m\u00FCssen noch einige Einstellungen f\u00FCr die Bilderanzeige vorgenommen werden.<br><br> 

StatusPanel.channel = Sender ausw\u00E4hlen
StatusPanel.done    = Fertig
StatusPanel.network = Netzwerk
StatusPanel.title   = Schritt {0} von {1}: {2}

SubscribeChannelCardPanel.noChannelsSelected       = Es sind keine Sender zum Download ausgew\u00E4hlt.\nMarkieren Sie die gew\u00FCnschten Sender und verschieben Sie sie nach rechts.
SubscribeChannelCardPanel.noChannelsSelected.Title = Keine Sender ausgew\u00E4hlt

TvBrowserPictureSettingsUpdateDialog.accept  = Ja, ich m\u00F6chte keine Bilder
TvBrowserPictureSettingsUpdateDialog.back    = Zur\u00FCck zur Einstellung
TvBrowserPictureSettingsUpdateDialog.text    = <html><span style="color:red">ACHTUNG: </span>Das Herunterladen der Bilder ist deaktiviert!<br><br>Sind Sie sicher, dass Sie die Bilder nicht herunterladen m\u00F6chten?</html>
TvBrowserPictureSettingsUpdateDialog.warning = Warnung

WelcomeCardPanel.welcome = <HTML><h1>Willkommen bei TV-Browser&nbsp;{0}!</h1><br>Vor dem ersten Start m\u00FCssen noch einige <b>Einstellungen</b> vorgenommen werden.<br><br>Klicken Sie auf <i>Weiter</i>, um TV-Browser <b>jetzt zu konfigurieren</b> oder auf <i>Abbrechen</i>, wenn Sie die Einstellungen ohne Assistenten vornehmen m\u00F6chten.<br><br>\nSie k\u00F6nnen den Assistenten unter <i>Hilfe -&gt; Einrichtungs-Assistent</i> jederzeit wieder aufrufen.<br><br><br><br>\nWeitere Hinweise zum Einrichtungs-Assistenten gibt es im <a href="http://wiki.tvbrowser.org/index.php/Installation">Online-Handbuch</a>.</HTML>
