
ConfigAssistant.back            = Zur\u00FCck
ConfigAssistant.button.1        = Assistent schlie\u00DFen
ConfigAssistant.button.2        = Konfiguration fortsetzen
ConfigAssistant.cancel          = Abbrechen
ConfigAssistant.cancelDlg       = Der Konfigurationsvorgang ist noch nicht abgeschlossen.\nWie wollen Sie fortfahren?\n\nSie k\u00F6nnen den Assistenten unter Hilfe -> Einrichtungs-Assistent \njederzeit wieder aufrufen.
ConfigAssistant.cancelDlg.title = Assistent schlie\u00DFen
ConfigAssistant.finish          = Fertig
ConfigAssistant.next            = Weiter
ConfigAssistant.notShowAgain    = Assistent nicht wieder anzeigen.
ConfigAssistant.title           = TV-Browser einrichten

FinishCardPanel.description = <h2>Herzlichen Gl\u00FCckwunsch!</h2>\nSie haben den TV-Browser <b>erfolgreich</b> und <b>vollst\u00E4ndig</b> konfiguriert. Klicken Sie auf <i>Fertig</i> um den Einrichtungs-Assistenten zu beenden.<br><br>\n<b>Wie geht es weiter?</b><br><br>\nWir empfehlen Ihnen, einen Blick in unser <a href="http://wiki.tvbrowser.org">online Handbuch</a> zu werfen. Dort finden Sie <b>wertvolle Tipps und Tricks</b> zum Umgang mit dem TV-Browser.<br><br>\nBei <b>Problemen und Fragen</b> finden Sie Hilfe in unserem <a href="http://forum.tvbrowser.org">Forum</a>. Dort k\u00F6nnen Sie auch Anregungen f\u00FCr die Verbesserung des TV-Browsers hinterlassen.<br><br>\nWir w\u00FCnschen Ihnen <b>viel Spa\u00DF und ein besseres Fernsehen mit dem TV-Browser!</b>

NetworkCardPanel.auth            = Authentifizierung am Proxy-Server notwendig:
NetworkCardPanel.closing         = <html>\n<b>Bei Problemen</b> k\u00F6nnen Sie versuchen <a href="http://forum.tvbrowser.org">im Forum</a> Hilfe zu erhalten (hierf\u00FCr ben\u00F6tigen Sie einen Internetzugang!)<br><br>\nBitte klicken Sie auf <i>Weiter</i> sobald Sie meinen, dass TV-Browser auf das Internet zugreifen kann!\n</html>
NetworkCardPanel.connectionError = <html>\n<b>Internetverbindung konnte nicht hergestellt werden!</b><br><br>\nTV-Browser konnte sich nicht erfolgreich mit dem Internet verbinden.<br>\nDies ist f\u00FCr die weitere Installation jedoch zwingend notwendig, da alle <br>\nInformationen zu den Sendern und Sendungen nur online vorhanden sind.<br><br>\n<b>Wenn Sie eine Firewall benutzen:</b><br><br>\nStellen Sie bitte Ihre Firewall so ein, dass der <b>TV-Browser</b> <b>Zugriff auf das<br>\nInternet</b> hat. Sie finden Informationen zu den <b>Einstellungen</b> der g\u00E4ngigsten<br>\nFirewalls auf <a href="http://wiki.tvbrowser.org/firewalls">unserer Homepage</a>. <br><br>\nBitte stellen Sie sicher, dass die Online-Verbindung funktioniert und holen Sie<br>\nsich ggf. <b>Hilfe</b> im TV-Browser <a href="http://forum.tvbrowser.org">Online-Forum</a> oder bei Ihrem<br>\nNetzwerkadministrator.\n</html>
NetworkCardPanel.error           = Fehler
NetworkCardPanel.host            = Host
NetworkCardPanel.myProxy         = Mein HTTP-Proxy:
NetworkCardPanel.password        = Passwort
NetworkCardPanel.port            = Port
NetworkCardPanel.preambel        = TV-Browser versucht sich im <b>n\u00E4chsten Schritt mit dem Internet zu verbinden</b>. Dies kann bis zu 30 Sekunden dauern.<br><br>\nDie Verbindung ins Internet ist notwendig, um die Sender- und Sendungsinformationen herunterzuladen.<br><br>\n<b>Ohne Internetzugang geht es leider nicht!</b> Falls Sie die Internetverbindung manuell herstellen m\u00FCssen, so machen Sie dies bitte bevor Sie auf <i>Weiter</i> klicken. Stellen Sie ggf. Ihre <a href="http://wiki.tvbrowser.org/Firewalls">Firewall</a> so ein, dass TV-Browser auf das Internet zugreifen kann.
NetworkCardPanel.user            = Benutzer
NetworkCardPanel.usingProxy      = <html>Ich benutze einen Proxy-Server um mich mit dem Internet zu verbinden<br>(Wenn Sie nicht wissen, was ein Proxy ist, dann ben\u00F6tigen Sie vermutlich keinen)</html>

NetworkSuccessPanel = 

NetworkSuccessPanel.success = <h2>Netzwerk eingerichtet!</h2>\nTV-Browser hat sich <b>erfolgreich</b> mit dem Internet verbunden!<br><br>Im n\u00E4chsten Schritt wird TV-Browser die Liste der aktuell <b>verf\u00FCgbaren Sender heruntergeladen</b>.<br><br>\nBitte klicken Sie auf <i>Weiter</i>, damit TV-Browser jetzt die Senderliste herunterladen kann.

StatusPanel.channel = Sender ausw\u00E4hlen
StatusPanel.done    = Fertig
StatusPanel.network = Netzwerk

SubscribeChannelCardPanel.noChannelsSelected       = Es sind keine Sender zum Download ausgew\u00E4hlt.\nMarkieren Sie die gew\u00FCnschten Sender und verschieben Sie sie nach rechts.
SubscribeChannelCardPanel.noChannelsSelected.Title = Keine Sender ausgew\u00E4hlt

TvBrowserUpdateAssistant.cancel           = Abbrechen
TvBrowserUpdateAssistant.chooseDirectory  = Zu importierende TV-Daten ausw\u00E4hlen...
TvBrowserUpdateAssistant.error.1          = Ung\u00FCltiges Verzeichnis - Sie haben das bestehende Daten-Verzeichnis gew\u00E4hlt.
TvBrowserUpdateAssistant.error.2          = Das ausgew\u00E4hlte Verzeichnis enth\u00E4lt keine TV-Daten.
TvBrowserUpdateAssistant.error.2.title    = Ung\u00FCltiges Verzeichnis
TvBrowserUpdateAssistant.error.3          = TV-Daten konnten nicht importiert werden!
TvBrowserUpdateAssistant.error.msg.1      = Im angegebenen Verzeichnis wurde keine TV-Daten gefunden.
TvBrowserUpdateAssistant.error.msg.2      = Bitte w\u00E4hlen Sie das TV-Daten-Verzeichnis aus.
TvBrowserUpdateAssistant.error.title.1    = Ung\u00FCltiges Verzeichnis
TvBrowserUpdateAssistant.explain          = Damit TV-Browser {0} die bereits vorhandenen Einstellungen und TV-Programm-Daten \u00FCbernimmt, klicken Sie auf 'Importieren' und w\u00E4hlen Sie das TV-Daten-Verzeichnis der Vorg\u00E4ngerversion aus.\u00DCblicherweise ist dies 'tvdata' im TV-Browser-Ordner.
TvBrowserUpdateAssistant.import           = Importieren
TvBrowserUpdateAssistant.importStatus     = {0} Kan\u00E4le f\u00FCr den Import ausgew\u00E4hlt.
TvBrowserUpdateAssistant.option.1         = Sender-Einstellungen verwerfen
TvBrowserUpdateAssistant.question.1       = Es k\u00F6nnen TV-Daten mit {0} Sendern importiert werden.\nJetzt importieren?
TvBrowserUpdateAssistant.question.1.title = Importieren
TvBrowserUpdateAssistant.question.2       = Sie haben keine TV-Daten f\u00FCr den Import ausgew\u00E4hlt.\nSind Sie sicher, dass Sie evtl. vorhandene Sender-Einstellungen verwerfen und TV-Browser neu einrichten wollen?
TvBrowserUpdateAssistant.startTVBrowser   = TV-Browser starten
TvBrowserUpdateAssistant.status.1         = Importiere TV-Daten...
TvBrowserUpdateAssistant.status.2         = {0} Sender erfolgreich importiert.
TvBrowserUpdateAssistant.updateTo         = Aktualisierung auf TV-Browser {0}
TvBrowserUpdateAssistant.welcome          = Willkommen bei TV-Browser {0}!

WelcomeCardPanel.welcome = <HTML><h1>Willkommen bei TV-Browser&nbsp;{0}!</h1><br>Vor dem ersten Start m\u00FCssen noch einige <b>Einstellungen</b> vorgenommen werden.<br><br><b>Klicken Sie auf <i>Weiter</i></b>, um TV-Browser <b>jetzt zu konfigurieren</b> oder auf <i>Abbrechen</i>, wenn Sie die Einstellungen ohne Assistenten vornehmen m\u00F6chten.<br><br>\nSie k\u00F6nnen den Assistenten unter <i>Hilfe -&gt; Einrichtungs-Assistent</i> jederzeit wieder aufrufen.<br><br>\nHinweise zum Einrichtungs-Assistenten im <a href="http://wiki.tvbrowser.org/index.php/Installation">Online-Handbuch</a>.</HTML>
