#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Tue Mar 12 15:38:59 CET 2013
AuthenticationChannelCardPanel.info1=<div style\="font-weight\:bold;">\u039C\u03B5\u03C1\u03B9\u03BA\u03B5\u03C2 \u03C0\u03B7\u03B3\u03B5\u03C2 \u03C4\u03B7\u03BB\u03B5\u03BF\u03C0\u03C4\u03B9\u03BA\u03C9\u03BD \u03B4\u03B5\u03B4\u03BF\u03BC\u03B5\u03BD\u03C9\u03BD \u03C7\u03C1\u03B5\u03B9\u03B1\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C4\u03B1\u03C5\u03C4\u03BF\u03C0\u03BF\u03B9\u03B7\u03C3\u03B7. \u03A0\u03C1\u03B5\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B5\u03B9\u03C3\u03B1\u03B3\u03B5\u03C4\u03B5 \u03C4\u03B1 \u03B4\u03B5\u03B4\u03BF\u03BC\u03B5\u03BD\u03B1 \u03C4\u03B1\u03C5\u03C4\u03BF\u03C0\u03BF\u03B9\u03B7\u03C3\u03B7\u03C2 \u03B1\u03BD \u03B8\u03B5\u03BB\u03C4\u03B5 \u03BD\u03B1 \u03B5\u03C7\u03B5\u03C4\u03B5 \u03B4\u03B5\u03B4\u03BF\u03BC\u03B5\u03BD\u03B1 \u03B3\u03B9\u03B1 \u03C4\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1 \u03C0\u03B7\u03B3\u03C9\u03BD</div>
AuthenticationChannelCardPanel.info2=<div style\="color\:green;font-weight\:bold;font-size\:medium;">\u0391\u03BD \u03B4\u03B5\u03BD \u03C7\u03C1\u03B5\u03B9\u03AC\u03B6\u03B5\u03C3\u03C4\u03B5 \u03C4\u03B1 \u03BA\u03B1\u03BD\u03AC\u03BB\u03B9\u03B1 \u03C4\u03C9\u03BD \u03B5\u03B9\u03C3\u03B7\u03B3\u03BC\u03AD\u03BD\u03C9\u03BD \u03C0\u03B7\u03B3\u03C9\u03BD \u03B4\u03B5\u03B4\u03BF\u03BC\u03AD\u03BD\u03C9\u03BD \u03C4\u03B7\u03BB\u03B5\u03CC\u03C1\u03B1\u03C3\u03B7\u03C2, \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF\u03C4\u03B5 \u03BD\u03B1 \u03BC\u03B5\u03C4\u03B1\u03B2\u03B5\u03AF\u03C4\u03B5 \u03C3\u03C4\u03BF \u03B5\u03C0\u03CC\u03BC\u03B5\u03BD\u03BF \u03B2\u03AE\u03BC\u03B1. </div>
ConfigAssistant.button.1=\u039A\u03BB\u03B5\u03B9\u03C3\u03B9\u03BC\u03BF \u03B2\u03BF\u03B7\u03B8\u03BF\u03C5
ConfigAssistant.button.2=\u03A3\u03C5\u03BD\u03B5\u03C7\u03B9\u03C3\u03B7 \u03B4\u03B9\u03B1\u03BC\u03BF\u03C1\u03C6\u03C9\u03C3\u03B7\u03C2
ConfigAssistant.cancelDlg=\u0397 \u03B1\u03C1\u03C7\u03B9\u03BA\u03AE \u03B4\u03B9\u03B1\u03BC\u03CC\u03C1\u03C6\u03C9\u03C3\u03B7 \u03B4\u03B5\u03BD \u03B5\u03AF\u03BD\u03B1\u03B9 \u03C0\u03BB\u03AE\u03C1\u03B7\u03C2. \u03A0\u03CE\u03C2 \u03B8\u03AD\u03BB\u03B5\u03C4\u03B5 \u03BD\u03B1 \u03C3\u03C5\u03BD\u03B5\u03C7\u03AF\u03C3\u03B5\u03C4\u03B5? \u039C\u03C0\u03BF\u03C1\u03B5\u03AF\u03C4\u03B5 \u03BD\u03B1 \u03B5\u03C0\u03B1\u03BD\u03B5\u03BA\u03BA\u03B9\u03BD\u03AE\u03C3\u03B5\u03C4\u03B5 \u03C4\u03BF\u03BD \u03B2\u03BF\u03B7\u03B8\u03BF \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03BF\u03BD\u03C4\u03B1\u03C2 \u03C4\u03BF \u03BC\u03B5\u03BD\u03BF\u03C5 \u0392\u03BF\u03AE\u03B8\u03B5\u03B9\u03B1 - > \u0395\u03BD\u03B1\u03C1\u03BE\u03B7 \u03C4\u03BF\u03C5 \u03B2\u03BF\u03B7\u03B8\u03BF\u03C5 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03C9\u03BD. 
ConfigAssistant.cancelDlg.title=\u039A\u03BB\u03B5\u03B9\u03C3\u03B9\u03BC\u03BF \u03B2\u03BF\u03B7\u03B8\u03BF\u03C5
ConfigAssistant.finish=\u03A4\u03B5\u03BB\u03BF\u03C2
ConfigAssistant.notShowAgain=\u039A\u03B1\u03BC\u03BC\u03B9\u03B1 \u03B5\u03BC\u03C6\u03B1\u03BD\u03B9\u03C3\u03B7 \u03C4\u03BF\u03C5 \u03B2\u03BF\u03B7\u03B8\u03BF\u03C5 \u03BE\u03B1\u03BD\u03B1.
ConfigAssistant.title=\u0392\u03BF\u03B7\u03B8\u03BF\u03C2 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03C9\u03BD
FinishCardPanel.description=<h2>\u03A3\u03C5\u03B3\u03C7\u03B1\u03C1\u03B7\u03C4\u03B7\u03C1\u03B9\u03B1\!</h2>\n\u0395\u03C7\u03B5\u03C4\u03B5 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03B9 \u03B5\u03C0\u03B9\u03C4\u03C5\u03C7\u03C9\u03C2 \u03C4\u03BF TV-Browser. \u03A0\u03B1\u03C4\u03B7\u03C3\u03C4\u03B5 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF "\u03A4\u03B5\u03BB\u03BF\u03C2" \u03B3\u03B9\u03B1 \u03BD\u03B1 \u03BA\u03BB\u03B5\u03B9\u03C3\u03B8\u03B5\u03B9 \u03BF \u03B2\u03BF\u03B7\u03B8\u03BF\u03C2 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03C9\u03BD.<br><br>\n<b>\u03A3\u03C5\u03BD\u03B5\u03C7\u03B5\u03B9\u03B1?</b><br><br>\n\u03A3\u03B1\u03C2 \u03C0\u03C1\u03BF\u03C4\u03B5\u03AF\u03BD\u03BF\u03C5\u03BC\u03B5 \u03BD\u03B1 \u03C1\u03AF\u03BE\u03B5\u03C4\u03B5 \u03BC\u03B9\u03B1 \u03B3\u03C1\u03AE\u03B3\u03BF\u03C1\u03B7 \u03BC\u03B1\u03C4\u03B9\u03AC \u03C3\u03C4\u03BF\u03BD <a href\="http\://enwiki.tvbrowser.org">\u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03B1\u03BA\u03BF \u03BF\u03B4\u03B7\u03B3\u03BF \u03C7\u03C1\u03B7\u03C3\u03B7\u03C2</a>. \u039C\u03C0\u03BF\u03C1\u03B5\u03B9\u03C4\u03B5 \u03BD\u03B1 \u03B2\u03C1\u03B5\u03B9\u03C4\u03B5 \u03C3\u03B7\u03BC\u03B1\u03BD\u03C4\u03B9\u03BA\u03B1 <b>\u03B2\u03B7\u03B8\u03B7\u03BC\u03B1\u03C4\u03B1</b> \u03C0\u03BF\u03C5 \u03B8\u03B1 \u03C3\u03B1\u03C2 \u03B2\u03BF\u03B7\u03B8\u03B7\u03C3\u03BF\u03C5\u03BD \u03BD\u03B1 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B7\u03C3\u03B5\u03C4\u03B5 \u03BA\u03B1\u03BB\u03C5\u03C4\u03B5\u03C1\u03B1 \u03C4\u03BF TV-Browser.<br><br>\n\u0391\u03BD \u03B5\u03C7\u03B5\u03C4\u03B5 <b>\u03C0\u03C1\u03BF\u03B2\u03BB\u03B7\u03BC\u03B1\u03C4\u03B1 \u03B7 \u03B5\u03C1\u03C9\u03C4\u03B7\u03C3\u03B5\u03B9\u03C2</b> \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9\u03C4\u03B5 \u03BD\u03B1 \u03B2\u03C1\u03B5\u03B9\u03C4\u03B5 \u03B2\u03BF\u03B7\u03B8\u03B5\u03B9\u03B1 \u03C3\u03C4\u03BF<a href\="http\://hilfe.tvbrowser.org">\u03C6\u03BF\u03C1\u03BF\u03C5\u03BC</a>. <br><br><br><br>\n\u0395\u03BB\u03C0\u03B9\u03B6\u03BF\u03C5\u03BC\u03B5 \u03BD\u03B1 <b>\u03B1\u03C0\u03BF\u03BB\u03B1\u03C5\u03C3\u03B5\u03C4\u03B5 \u03C4\u03BF TV-Browser</b>\!
NetworkCardPanel.auth=\u0391\u03C0\u03B1\u03B9\u03C4\u03B5\u03B9\u03C4\u03B1\u03B9 \u03B5\u03BB\u03B5\u03B3\u03C7\u03BF\u03C2 \u03C4\u03B1\u03C5\u03C4\u03CC\u03C0\u03BF\u03B9\u03B7\u03C3\u03B7\u03C2 \u03C4\u03BF\u03C5 \u03B4\u03B9\u03B1\u03BA\u03BF\u03BC\u03B9\u03C3\u03C4\u03AE \u03BC\u03B5\u03C3\u03BF\u03BB\u03AC\u03B2\u03B7\u03C3\u03B7\u03C2\: 
NetworkCardPanel.closing=<html>\n\u0391\u03BD \u03B5\u03C7\u03B5\u03C4\u03B5 <b>\u03B4\u03C5\u03C3\u03BA\u03BF\u03BB\u03B9\u03B5\u03C2</b> \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9\u03C4\u03B5 \u03BD\u03B1 \u03B2\u03C1\u03B5\u03B9\u03C4\u03B5 \u03B2\u03BF\u03B7\u03B8\u03B5\u03B9\u03B1 \u03C3\u03C4\u03BF<a href\="http\://hilfe.tvbrowser.org">\u03C6\u03BF\u03C1\u03BF\u03C5\u03BC \u03BC\u03B1\u03C2</a> (\u03B3\u03B9\u03B1 \u03B1\u03C5\u03C4\u03BF \u03C7\u03C1\u03B5\u03B9\u03B1\u03B6\u03B5\u03C3\u03C4\u03B5 \u03C3\u03C5\u03BD\u03B4\u03B5\u03C3\u03B7 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF)\n<br><br>\n\u03A0\u03B1\u03C4\u03B7\u03C3\u03C4\u03B5 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF "\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9" \u03B1\u03BD \u03BD\u03BF\u03BC\u03B9\u03B6\u03B5\u03C4\u03B5 \u03C0\u03C9\u03C2 \u03C4\u03BF TV-Browser \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9 \u03BD\u03B1 \u03C3\u03C5\u03BD\u03B4\u03B5\u03B8\u03B5\u03B9 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF\!\n</html>
NetworkCardPanel.connectionError=<html>\n<b>\u0397 \u03C3\u03C5\u03BD\u03B4\u03B5\u03C3\u03B7 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9 \u03BD\u03B1 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03B7\u03B8\u03B5\u03B9\!</b><br><br>\n\u03A4\u03BF TV-Browser \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9 \u03BD\u03B1 \u03C3\u03C5\u03BD\u03B4\u03B5\u03B8\u03B5\u03B9 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF.<br>\n\u0391\u03C5\u03C4\u03BF \u03C0\u03C1\u03B5\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B3\u03B9\u03BD\u03B5\u03B9 \u03B3\u03B9\u03B1 \u03C4\u03B7\u03BD \u03B5\u03B3\u03BA\u03B1\u03C4\u03B1\u03C3\u03C4\u03B1\u03C3\u03B7,\u03B3\u03B9\u03B1\u03C4\u03B9 \u03BF\u03BB\u03B5\u03C2 \u03B7 \u03C0\u03BB\u03B7\u03C1\u03BF\u03C6\u03BF\u03C1\u03B9\u03B5\u03C2 \u03C3\u03C7\u03B5\u03C4\u03B9\u03BA\u03B1 \u03BC\u03B5 \u03C4\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1<br>\n\u03BA\u03B1\u03B9 \u03C4\u03B1 \u03C0\u03C1\u03BF\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03B1 \u03B5\u03B9\u03BD\u03B1\u03B9 \u03BC\u03BF\u03BD\u03BF \u03B4\u03B9\u03B1\u03B8\u03B5\u03C3\u03B9\u03BC\u03B1 \u03C3\u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF.<br><br>\n<b>\u0391\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03B9\u03C4\u03B5 firewall\:</b><br><br>\n\u03A3\u03B9\u03B3\u03BF\u03C5\u03C1\u03B5\u03C5\u03C4\u03B5\u03B9\u03C4\u03B5 \u03C0\u03C9\u03C2 \u03B7 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03B9\u03C2 \u03C4\u03B7\u03C2 firewall \u03B5\u03C0\u03B9\u03C4\u03C1\u03B5\u03C0\u03BF\u03C5\u03BD \u03C3\u03C4\u03BF <b>TV-Browser</b> \u03BD\u03B1<b>\u03C3\u03C5\u03BD\u03B4\u03B5\u03B8\u03B5\u03B9 \u03BC\u03B5<br>\n\u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF</b>. \u0398\u03B1 \u03B2\u03C1\u03B5\u03B9\u03C4\u03B5 \u03C0\u03BB\u03B7\u03C1\u03BF\u03C6\u03BF\u03C1\u03B9\u03B5\u03C2 \u03C3\u03C7\u03B5\u03C4\u03B9\u03BA\u03B1 \u03BC\u03B5 \u03C4\u03B7\u03C2<b>\u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03B9\u03C2</b> \u03C4\u03C9\u03BD \u03C0\u03B9\u03BF \u03B4\u03B7\u03BC\u03BF\u03C6\u03B9\u03BB\u03C9\u03BD <br>\firewall \u03C3\u03C4\u03B7\u03BD \u03B9\u03C3\u03C4\u03BF\u03C3\u03B5\u03BB\u03B9\u03B4\u03B1 <a href\="http\://enwiki.tvbrowser.org/index.php/Firewalls"></a>. \u03A3\u03B9\u03B3\u03BF\u03C5\u03C1\u03B5\u03C5\u03C4\u03B5\u03B9\u03C4\u03B5 \u03C0\u03C9\u03C2 \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9 \u03BD\u03B1 \u03B4\u03B7\u03BC\u03B9\u03BF\u03C5\u03C1\u03B3\u03B7\u03B8\u03B5\u03B9 \u03C3\u03C5\u03BD\u03B4\u03B5\u03C3\u03B7 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF<br>\n\u039C\u03C0\u03BF\u03C1\u03B5\u03B9\u03C4\u03B5 \u03BD\u03B1 \u03C0\u03B1\u03C1\u03B5\u03C4\u03B5 <b>\u03B2\u03BF\u03B7\u03B8\u03B5\u03B9\u03B1</b> \u03C3\u03C4\u03BF<a href\="http\://hilfe.tvbrowser.org">\u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03B1\u03BA\u03BF \u03C6\u03BF\u03C1\u03BF\u03C5\u03BC \u03BC\u03B1\u03C2</a> \u03B7 \u03B1\u03C0\u03BF \u03C4\u03BF\u03BD \u03B4\u03B9\u03B1\u03C7\u03B5\u03B9\u03C1\u03B9\u03C3\u03C4\u03B7 \u03B4\u03B9\u03BA\u03C4\u03C5\u03C9\u03BD\n</html>
NetworkCardPanel.host=\u039E\u03B5\u03BD\u03B9\u03C3\u03C4\u03AE\u03C2
NetworkCardPanel.myProxy=\u03A4\u03BF HTTP-Proxy \u03BC\u03BF\u03C5\:
NetworkCardPanel.password=\u039A\u03C9\u03B4\u03B9\u03BA\u03BF\u03C2
NetworkCardPanel.port=\u0395\u03B9\u03C3\u03BF\u03B4\u03BF\u03C2
NetworkCardPanel.preambel=\u03A4\u03BF TV-Browser \u03B8\u03B1 \u03C0\u03C1\u03BF\u03C3\u03C0\u03B1\u03B8\u03B7\u03C3\u03B5\u03B9 \u03BD\u03B1<b>\u03C3\u03C5\u03BD\u03B4\u03B5\u03B8\u03B5\u03B9 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF</b> \u03BF\u03C4\u03B1\u03BD \u03C0\u03B1\u03C4\u03B7\u03C3\u03B5\u03C4\u03B5 \u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF<i>\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9</i>. \u0391\u03C5\u03C4\u03CC \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03B4\u03B9\u03B1\u03C1\u03BA\u03AD\u03C3\u03B5\u03B9 \u03BC\u03AD\u03C7\u03C1\u03B9 \u03BA\u03B1\u03B9 30 \u03B4\u03B5\u03C5\u03C4\u03B5\u03C1\u03CC\u03BB\u03B5\u03C0\u03C4\u03B1.<br><br>\n\u0397 \u03C3\u03C5\u03BD\u03B4\u03B5\u03C3\u03B7 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF \u03B5\u03B9\u03BD\u03B1\u03B9 \u03C3\u03B7\u03BC\u03B1\u03BD\u03C4\u03B9\u03BA\u03B7. \u03A7\u03C9\u03C1\u03B9\u03C2 \u03B1\u03C5\u03C4\u03B7, \u03C4\u03BF TV browser \u03B4\u03B5\u03BD \u03BC\u03C0\u03BF\u03C1\u03B5\u03B9 \u03BD\u03B1 \u03BA\u03B1\u03C4\u03B5\u03B2\u03B1\u03C3\u03B5\u03B9 \u03C4\u03B7\u03C2 \u03BA\u03B1\u03C4\u03B1\u03C7\u03C9\u03C1\u03B7\u03C3\u03B5\u03B9\u03C2 \u03C4\u03B7\u03BB\u03B5\u03BF\u03C1\u03B1\u03C3\u03B7\u03C2.<br><br><b>\u03A3\u03B9\u03B3\u03BF\u03C5\u03C1\u03B5\u03C5\u03C4\u03B5\u03B9\u03C4\u03B5 \u03C0\u03C9\u03C2 \u03B5\u03C7\u03B5\u03C4\u03B5 \u03C3\u03C5\u03BD\u03B4\u03B5\u03B8\u03B5\u03B9 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF \u03C0\u03C1\u03B9\u03BD \u03C0\u03B1\u03C4\u03B7\u03C3\u03B5\u03C4\u03B5 \u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF <i>\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9</i>.</b><br>\u0391\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B5\u03B9\u03C4\u03B5 \u03BC\u03B9\u03B1<a href\="http\://enwiki.tvbrowser.org/index.php/Firewalls">firewall</a>, \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03C4\u03B5 \u03C4\u03B7\u03BD \u03B1\u03BD\u03B1\u03BB\u03BF\u03B3\u03C9\u03C2.
NetworkCardPanel.user=\u03A7\u03C1\u03B7\u03C3\u03C4\u03B7\u03C2
NetworkCardPanel.usingProxy=<html>\u03A7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03C9 \u03B5\u03BD\u03B1\u03BD \u03B4\u03B9\u03B1\u03BA\u03BF\u03BC\u03B9\u03C3\u03C4\u03B7 \u03BC\u03B5\u03C3\u03BF\u03BB\u03B1\u03B2\u03B7\u03C3\u03B7\u03C2 \u03B3\u03B9\u03B1 \u03C3\u03C5\u03BD\u03B4\u03B5\u03C3\u03B7 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF<br>(\u0391\u03BD \u03B4\u03B5\u03BD \u03BE\u03B5\u03C1\u03B5\u03C4\u03B5 \u03C4\u03B9 \u03B5\u03B9\u03BD\u03B1\u03B9 \u03BF \u03B4\u03B9\u03B1\u03BA\u03BF\u03BC\u03B9\u03C3\u03C4\u03B7\u03C2 \u03BC\u03B5\u03C3\u03BF\u03BB\u03B1\u03B2\u03B7\u03C3\u03B7\u03C2, \u03B4\u03B5\u03BD \u03C4\u03BF\u03BD \u03C7\u03C1\u03B5\u03B9\u03B1\u03B6\u03B5\u03C3\u03C4\u03B5)</html>
NetworkSuccessPanel.success=<h2>\u0397 \u03B4\u03BF\u03BA\u03B9\u03BC\u03B7 \u03B4\u03B9\u03BA\u03C4\u03C5\u03BF\u03C5 \u03C0\u03B5\u03C4\u03C5\u03C7\u03B5\!</h2>\n\u03A4\u03BF TV-Browser \u03C3\u03C5\u03BD\u03B4\u03B5\u03B8\u03B7\u03BA\u03B5 \u03BC\u03B5 \u03C4\u03BF \u03B4\u03B9\u03B1\u03B4\u03B9\u03BA\u03C4\u03C5\u03BF <b>\u03B5\u03C0\u03B9\u03C4\u03C5\u03C7\u03C9\u03C2</b><br><br>\n\u03A3\u03C4\u03BF \u03B5\u03C0\u03BF\u03BC\u03B5\u03BD\u03BF \u03B2\u03B7\u03BC\u03B1 \u03C4\u03BF TV-Browser \u03B8\u03B1 \u03B5\u03BC\u03C6\u03B1\u03BD\u03B9\u03C3\u03B5\u03B9 \u03BC\u03B9\u03B1 \u03BB\u03B9\u03C3\u03C4\u03B1 \u03C4\u03C9\u03BD <b>\u03B4\u03B9\u03B1\u03B8\u03B5\u03C3\u03B9\u03BC\u03C9\u03BD \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD</b>.<br><br><br><br>\n\u03A0\u03B1\u03C4\u03B7\u03C3\u03C4\u03B5 \u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF <i>\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9</i> \u03B3\u03B9\u03B1 \u03BB\u03C5\u03C8\u03B7 \u03C4\u03B7\u03C2 \u03BB\u03B9\u03C3\u03C4\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD.
PictureConfigPanel.allPictures=\u039B\u03C5\u03C8\u03B7 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD \u03B1\u03C0\u03BF \u03BF\u03BB\u03B1 \u03C4\u03B1 \u03C0\u03C1\u03BF\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03B1
PictureConfigPanel.closing=<html><span style\="color\:red">\u03A0\u03A1\u039F\u03A3\u039F\u03A7\u0397\: </span>\u039F\u03B9 \u03B5\u03B9\u03BA\u03BF\u03BD\u03B5\u03C2 \u03B4\u03B5\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 \u03B4\u03B9\u03B1\u03B8\u03B5\u03C3\u03B9\u03BC\u03B5\u03C2 \u03B3\u03B9\u03B1 \u03BF\u03BB\u03B1 \u03C4\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1. \u0391\u03C5\u03C4\u03BF <b>\u03B4\u03B5\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 bug</b> \u03B1\u03BD \u03C4\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1 <b>\u03B4\u03B5\u03BD \u03B5\u03BC\u03C6\u03B1\u03BD\u03B9\u03B6\u03BF\u03C5\u03BD \u03B5\u03B9\u03BA\u03BF\u03BD\u03B5\u03C2</b>.<br><br><br><br>\u03A0\u03B1\u03C4\u03B7\u03C3\u03C4\u03B5 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF "\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9" \u03B3\u03B9\u03B1 \u03BD\u03B1 \u03C3\u03C5\u03BD\u03B5\u03C7\u03B9\u03C3\u03B5\u03C4\u03B5.\n</html>
PictureConfigPanel.closingUpdate=<html><span style\="color\:red">\u03A0\u03A1\u039F\u03A3\u039F\u03A7\u0397\: </span>\u039F\u03B9 \u03B5\u03B9\u03BA\u03BF\u03BD\u03B5\u03C2 \u03B4\u03B5\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 \u03B4\u03B9\u03B1\u03B8\u03B5\u03C3\u03B9\u03BC\u03B5\u03C2 \u03B3\u03B9\u03B1 \u03BF\u03BB\u03B1 \u03C4\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1. \u0391\u03C5\u03C4\u03BF <b>\u03B4\u03B5\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 bug</b> \u03B1\u03BD \u03C4\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1 <b>\u03B4\u03B5\u03BD \u03B5\u03BC\u03C6\u03B1\u03BD\u03B9\u03B6\u03BF\u03C5\u03BD \u03B5\u03B9\u03BA\u03BF\u03BD\u03B5\u03C2</b>.<br><br><br><br>\u03A0\u03B1\u03C4\u03B7\u03C3\u03C4\u03B5 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF "\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9" \u03B3\u03B9\u03B1 \u03BD\u03B1 \u03C3\u03C5\u03BD\u03B5\u03C7\u03B9\u03C3\u03B5\u03C4\u03B5.\n</html>
PictureConfigPanel.eveningPictures=\u039B\u03C5\u03C8\u03B7 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD \u03B3\u03B9\u03B1 \u03C4\u03B1 \u03B1\u03C0\u03BF\u03B3\u03B5\u03C5\u03BC\u03B1\u03C4\u03B9\u03BD\u03B1 \u03C0\u03C1\u03BF\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03B1 (4 \u03C4\u03BF \u03B1\u03C0\u03BF\u03B3\u03B5\u03C5\u03BC\u03B1 \u03BC\u03B5\u03C7\u03C1\u03B9 \u03C4\u03B1 \u03BC\u03B5\u03C3\u03B1\u03BD\u03C5\u03C7\u03C4\u03B1)
PictureConfigPanel.morningPictures=\u039B\u03C5\u03C8\u03B7 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD \u03BC\u03BF\u03BD\u03BF \u03B3\u03B9\u03B1 \u03C4\u03B1 \u03C0\u03C1\u03C9\u03B9\u03BD\u03B1 \u03C0\u03C1\u03BF\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1\u03C4\u03B1 (\u039C\u03B5\u03C3\u03B1\u03BD\u03C5\u03C7\u03C4\u03B1 \u03BC\u03B5\u03C7\u03C1\u03B9 \u03C4\u03B7\u03C2 4 \u03C4\u03BF \u03B1\u03C0\u03BF\u03B3\u03B5\u03C5\u03BC\u03B1)
PictureConfigPanel.noPictures=\u039A\u03B1\u03BC\u03BC\u03B9\u03B1 \u03BB\u03C5\u03C8\u03B7 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD
PictureConfigPanel.pictureSettings=\u03A1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03B9\u03C2 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD
PictureConfigPanel.preambel=\u0395\u03B4\u03CE \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF\u03C4\u03B5 \u03BD\u03B1 \u03B5\u03C0\u03B9\u03BB\u03AD\u03BE\u03B5\u03C4\u03B5 \u03B1\u03BD \u03BF\u03B9 \u03C6\u03C9\u03C4\u03BF\u03B3\u03C1\u03B1\u03C6\u03AF\u03B5\u03C2 \u03B8\u03B1 \u03C0\u03C1\u03AD\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03BB\u03C5\u03C6\u03B8\u03BF\u03C5\u03BD \u03B1\u03BD \u03C4\u03BF \u03BA\u03B1\u03BD\u03AC\u03BB\u03B9 \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03B9 \u03B5\u03B9\u03BA\u03CC\u03BD\u03B5\u03C2. <br><br>\u0391\u03C5\u03C4\u03B7 \u03B7 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B7 <b>\u03B5\u03C0\u03B7\u03C1\u03B5\u03AC\u03B6\u03B5\u03B9 \u03BC\u03CC\u03BD\u03BF \u03C4\u03B7 \u03BB\u03AE\u03C8\u03B7</b>. \u0391\u03BD \u03BF\u03B9 \u03B5\u03B9\u03BA\u03CC\u03BD\u03B5\u03C2 \u03B5\u03BC\u03C6\u03B1\u03BD\u03AF\u03B6\u03BF\u03BD\u03C4\u03B1\u03B9 \u03C3\u03B5 \u03AD\u03BD\u03B1 \u03C3\u03C4\u03BF\u03B9\u03C7\u03B5\u03AF\u03BF, \u03BC\u03C0\u03BF\u03C1\u03B5\u03AF \u03BD\u03B1 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03C4\u03B5\u03AF \u03C7\u03C9\u03C1\u03B9\u03C3\u03C4\u03AC.<br><br>\u03A3\u03C4\u03BF\u03BD \u03C0\u03AF\u03BD\u03B1\u03BA\u03B1 \u03C0\u03C1\u03CC\u03B3\u03C1\u03B1\u03BC\u03BC\u03B1 \u03C4\u03B9\u03C2 \u03B5\u03B9\u03BA\u03CC\u03BD\u03B5\u03C2 \u03B8\u03B1 \u03B5\u03BC\u03C6\u03B1\u03BD\u03B9\u03C3\u03C4\u03B5\u03AF \u03B3\u03B9\u03B1 \u03C0\u03C1\u03BF\u03B3\u03C1\u03AC\u03BC\u03BC\u03B1\u03C4\u03B1 \u03C0\u03BF\u03C5 \u03B5\u03AF\u03BD\u03B1\u03B9 \u03B1\u03C0\u03CC \u03C4\u03BF \u03C7\u03C1\u03CC\u03BD\u03BF \u03B1\u03C0\u03CC \u03C4\u03B9\u03C2 6\:00 \u03BC.\u03BC. \u03AD\u03C9\u03C2 11\:00 PM \u03B1\u03C0\u03CC \u03C0\u03C1\u03BF\u03B5\u03C0\u03B9\u03BB\u03BF\u03B3\u03AE.\n
PictureConfigPanel.preambelUpdate=\u0391\u03C5\u03C4\u03B7 \u03B7 \u03B5\u03BA\u03B4\u03BF\u03C3\u03B7 \u03C4\u03BF\u03C5 TV-Browser <b>\u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03B9\u03B6\u03B5\u03B9 \u03C4\u03B7\u03BD \u03B5\u03BC\u03C6\u03B1\u03BD\u03B9\u03C3\u03B7 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD</b>. \u0397 \u03AD\u03BA\u03B4\u03BF\u03C3\u03B7 \u03C0\u03BF\u03C5 \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03AE\u03C3\u03B1\u03C4\u03B5 \u03BC\u03AD\u03C7\u03C1\u03B9 \u03C3\u03AE\u03BC\u03B5\u03C1\u03B1 \u03B4\u03B5\u03BD \u03C5\u03C0\u03BF\u03C3\u03C4\u03B7\u03C1\u03AF\u03B6\u03B5\u03B9 \u03B5\u03B9\u03BA\u03CC\u03BD\u03B5\u03C2, \u03AD\u03C7\u03B5\u03C4\u03B5 \u03BD\u03B1 \u03BA\u03AC\u03BD\u03B5\u03C4\u03B5 \u03BA\u03AC\u03C0\u03BF\u03B9\u03B5\u03C2 \u03C1\u03C5\u03B8\u03BC\u03AF\u03C3\u03B5\u03B9\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03B9\u03C2 \u03B5\u03B9\u03BA\u03CC\u03BD\u03B5\u03C2.<br><br> 
StatusPanel.channel=\u0395\u03C0\u03B9\u03BB\u03BF\u03B3\u03B7 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03C9\u03BD
StatusPanel.done=\u03A4\u03B5\u03BB\u03BF\u03C2
StatusPanel.network=\u0394\u03B9\u03BA\u03C4\u03C5\u03BF
StatusPanel.title=\u0392\u03B7\u03BC\u03B1 {0} \u03B1\u03C0\u03BF {1}\: {2}
SubscribeChannelCardPanel.noChannelsSelected=\u0394\u03B5\u03BD \u03B5\u03C0\u03B9\u03BB\u03B5\u03BE\u03B1\u03C4\u03B5 \u03BA\u03B1\u03BD\u03B5\u03BD\u03B1 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9 \u03B3\u03B9\u03B1 \u03BB\u03C5\u03C8\u03B7.\n\u0395\u03C0\u03B9\u03BB\u03B5\u03BE\u03C4\u03B5 \u03C4\u03B1 \u03B1\u03B3\u03B1\u03C0\u03B7\u03BC\u03B5\u03BD\u03B1 \u03C3\u03B1\u03C2 \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1 \u03BA\u03B1\u03B9 \u03BC\u03B5\u03C4\u03B1\u03BA\u03B9\u03BD\u03B7\u03C3\u03C4\u03B5 \u03C4\u03B1 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF \u03C3\u03C4\u03B1 \u03B4\u03B5\u03BE\u03B9\u03B1. 
SubscribeChannelCardPanel.noChannelsSelected.Title=\u0394\u03B5\u03BD \u03B5\u03C0\u03B9\u03BB\u03B5\u03C7\u03B8\u03B7\u03BA\u03B1\u03BD \u03BA\u03B1\u03BD\u03B1\u03BB\u03B9\u03B1
TvBrowserPictureSettingsUpdateDialog.accept=\u039D\u03B1\u03B9, \u03B4\u03B5\u03BD \u03B8\u03B5\u03BB\u03C9 \u03B5\u03B9\u03BA\u03BF\u03BD\u03B5\u03C2
TvBrowserPictureSettingsUpdateDialog.back=\u03A0\u03B9\u03C3\u03C9 \u03C3\u03C4\u03B9\u03C2 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03B9\u03C2
TvBrowserPictureSettingsUpdateDialog.text=<html><span style\="color\:red">\u03A0\u03A1\u039F\u03A3\u039F\u03A7\u0397\: </span>\u0397 \u03BB\u03C5\u03C8\u03B7 \u03B5\u03B9\u03BA\u03BF\u03BD\u03C9\u03BD \u03B5\u03B9\u03BD\u03B1\u03B9 \u03B1\u03C0\u03B5\u03BD\u03B5\u03C1\u03B3\u03BF\u03C0\u03BF\u03B9\u03B7\u03BC\u03B5\u03BD\u03B7\!<br><br>\u0395\u03B9\u03C3\u03C4\u03B5 \u03C3\u03B9\u03B3\u03BF\u03C5\u03C1\u03BF\u03C2 \u03C0\u03C9\u03C2 \u03B4\u03B5\u03BD \u03B8\u03B5\u03BB\u03B5\u03C4\u03B5 \u03BD\u03B1 \u03BB\u03B5\u03B9\u03C6\u03B8\u03BF\u03C5\u03BD \u03B5\u03B9\u03BA\u03BF\u03BD\u03B5\u03C2.</html>
TvBrowserPictureSettingsUpdateDialog.warning=\u03A0\u03C1\u03BF\u03C3\u03BF\u03C7\u03B7
WelcomeCardPanel.welcome=<h1>\u039A\u03B1\u03BB\u03C9\u03C2 \u03B7\u03C1\u03B8\u03B1\u03C4\u03B5 \u03C3\u03C4\u03BF TV-Browser&nbsp;{0}\!</h1><br>\u03A0\u03C1\u03B9\u03BD \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03B7\u03C3\u03B5\u03C4\u03B5 \u03C4\u03BF TV-Browser \u03C0\u03C1\u03B5\u03C0\u03B5\u03B9 \u03BD\u03B1 \u03B3\u03B9\u03BD\u03BF\u03C5\u03BD \u03BA\u03B1\u03C0\u03BF\u03B9\u03B5\u03C2 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03B9\u03C2.<br><br>\u03A0\u03B1\u03C4\u03B7\u03C3\u03C4\u03B5 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF <i>\u03A0\u03B1\u03C1\u03B1\u03BA\u03B1\u03C4\u03C9</i> \u03B3\u03B9\u03B1 \u03BD\u03B1 \u03C3\u03C5\u03BD\u03B5\u03C7\u03B9\u03C3\u03B5\u03C4\u03B5, \u03B7 \u03C3\u03C4\u03BF \u03C0\u03BB\u03B1\u03B9\u03C3\u03B9\u03BF <i>\u0394\u03B9\u03B1\u03BA\u03BF\u03C0\u03B7</i> \u03B3\u03B9\u03B1 \u03BD\u03B1 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03C4\u03B5 \u03C7\u03C9\u03C1\u03B9\u03C2 \u03B2\u03BF\u03B7\u03B8\u03BF \u03C4\u03BF TV-Browser.<br><br>\n\u039C\u03C0\u03BF\u03C1\u03B5\u03B9\u03C4\u03B5 \u03BD\u03B1 \u03C4\u03C1\u03B5\u03BE\u03B5\u03C4\u03B5 \u03B1\u03C5\u03C4\u03BF \u03C4\u03BF\u03BD \u03B2\u03BF\u03B7\u03B8\u03BF \u03C7\u03C1\u03B7\u03C3\u03B9\u03BC\u03BF\u03C0\u03BF\u03B9\u03BF\u03BD\u03C4\u03B1\u03C2 <i>\u0392\u03BF\u03B7\u03B8\u03B5\u03B9\u03B1 -&gt; \u03A4\u03C1\u03B5\u03BE\u03B9\u03BC\u03BF \u03C4\u03BF\u03C5 \u03B2\u03BF\u03B7\u03B8\u03BF\u03C5 \u03C1\u03C5\u03B8\u03BC\u03B9\u03C3\u03B5\u03C9\u03BD</i>.<br><br><br><br>\u039C\u03C0\u03BF\u03C1\u03B5\u03B9\u03C4\u03B5 \u03BD\u03B1 \u03B2\u03C1\u03B5\u03B9\u03C4\u03B5 \u03C0\u03B5\u03C1\u03B9\u03C3\u03C3\u03BF\u03C4\u03B5\u03C1\u03B5\u03C2 \u03C0\u03BB\u03B7\u03C1\u03BF\u03C6\u03BF\u03C1\u03B9\u03B5\u03C2 \u03B3\u03B9\u03B1 \u03C4\u03BF\u03BD \u03B2\u03BF\u03B7\u03B8\u03BF \u03C3\u03C4\u03B7\u03BD \u03B9\u03C3\u03C4\u03BF\u03C3\u03B5\u03BB\u03B9\u03B4\u03B1<a href\="http\://enwiki.tvbrowser.org/index.php/Install">online manual</a>.
