#Translation for TV-Browser Version 3.2.1
#Saved by i18n Plugin Version 3.0.1.0
#Thu Dec 13 20:14:42 CET 2012
AuthenticationChannelCardPanel.info1=<div style\="font-weight\:bold;">Neki od izvora TV-podataka iziskuju ovjeravanje pristupa. Ukoliko potrebujete podatke za kanale iz navedenih izvora, morate ovdje zadati tra\u017Eene podatke.</div>
AuthenticationChannelCardPanel.info2=<div style\="color\:green;font-weight\:bold;font-size\:medium;">Ukoliko ne potrebujete podatke za kanale iz navedenih izvora, mo\u017Eete odmah prije\u0107i na slijede\u0107i korak.</div>
ConfigAssistant.button.1=Zatvori pomo\u0107nika
ConfigAssistant.button.2=Nastavi prilagodbu
ConfigAssistant.cancelDlg=Po\u010Detno postavljanje jo\u0161 nije zavr\u0161eno.\nKako \u017Eelite postupiti?\n\nOvog pomo\u0107nika mo\u017Eete iznova pokrenuti koriste\u0107i Pomo\u0107 -> Pokreni pomo\u0107nika postavljanja.
ConfigAssistant.cancelDlg.title=Zatvori pomo\u0107nika
ConfigAssistant.finish=Dovr\u0161i
ConfigAssistant.notShowAgain=Vi\u0161e ne prikazuj ovog pomo\u0107nika.
ConfigAssistant.title=Pomo\u0107nik postavljanja
FinishCardPanel.description=<h2>\u010Cestitamo\!</h2>\nUspje\u0161no ste postavili TV-Browser. \u010Cim stisnete gumb "Dovr\u0161i" Pomo\u0107nik postavljanja \u0107e biti zatvoren.<br><br>\n<b>\u0160to i kako dalje?</b><br><br>\nPreporu\u010Damo Vam da putem mre\u017Ee na kratko zavirite u <a href\="http\://enwiki.tvbrowser.org">korisni\u010Dki vodi\u010D</a>. Ondje \u0107ete prona\u0107i va\u017Ene <b>savjete i naputke</b>, koji Vam mogu pomo\u0107i pri kori\u0161tenju TV-Browsera.<br><br>\nUkoliko bi imali bilo kakvih <b>pote\u0161ko\u0107a ili pitanja</b>, pomo\u0107 mo\u017Eete potra\u017Eiti na na\u0161em <a href\="http\://hilfe.tvbrowser.org">forumu</a>. <br><br><br><br>\n\u017Delimo Vam puno zadovoljstva i jo\u0161 bolji TV-program s <b>TV-Browserom</b>\!
NetworkCardPanel.auth=Potrebna je ovjera pristupa posredni\u010Dkom poslu\u017Eitelju\:
NetworkCardPanel.closing=<html>\nUkoliko <b>nai\u0111ete na pote\u0161ko\u0107e</b> mo\u017Eete poku\u0161ati dobiti pomo\u0107 na <a href\="http\://hilfe.tvbrowser.org">na\u0161em forumu</a> (za \u0161to Vam je dakako potreban pristup Internetu\!).\n<br><br>\nKliknite na gumb "Slijede\u0107e" \u010Dim budete dr\u017Eali da se TV-Browser mo\u017Ee povezati s Internetom\!\n</html>
NetworkCardPanel.connectionError=<html>\n<b>Veza s Internetom nije mogla biti uspostavljena\!</b><br><br>\nTV-Browser se nije mogao uspje\u0161no povezati s Internetom.<br>\nZa daljnju instalaciju je to me\u0111utim neophodno, jer su svi podatci o postajama<br>\ni emisijama dostupni isklju\u010Divo putem mre\u017Ee.<br><br>\n<b>Ukoliko koristite vatrozid\:</b><br><br>\nPostavite Va\u0161 vatrozid tako da <b>TV-Browser</b> ima dopu\u0161teno <b>povezivanje s<br>\nInternetom</b>. Informacije o <b>postavkama</b> najkori\u0161tenijih <br>vatrozida mo\u017Eete prona\u0107i na <a href\="http\://enwiki.tvbrowser.org/index.php/Firewalls">na\u0161im stranicama</a>. Uvjerite se da veza s Internetom radi kako treba.<br>\n<b>Pomo\u0107</b> mo\u017Eete ina\u010De potra\u017Eiti na na\u0161em <a href\="http\://hilfe.tvbrowser.org">mre\u017Enom forumu</a> ili pak kod Va\u0161eg mre\u017Enog administratora.\n</html>\n
NetworkCardPanel.host=Glavno ra\u010Dunalo
NetworkCardPanel.myProxy=Moj proxy HTTP-a\:
NetworkCardPanel.password=Zaporka
NetworkCardPanel.port=Priklju\u010Dak
NetworkCardPanel.preambel=TV-Browser \u0107e se poku\u0161ati <b>povezati s Internetom</b> kada pritisnete <i>Slijede\u0107e</i>. To mo\u017Ee potrajati 30-ak sekundi.<br><br>\nVeza s Internetom je va\u017Ena. Bez nje TV-Browser ne mo\u017Ee preuzimati TV-podatke.<br><br><b>Molimo da prije nego kliknete <i>Slijede\u0107e</i> provjerite je li Va\u0161e ra\u010Dunalo povezano s Internetom.</b><br>Ukoliko koristite <a href\="http\://enwiki.tvbrowser.org/index.php/Firewalls">vatrozid</a>, molimo da ga sukladno tomu prilagodite.
NetworkCardPanel.user=Korisnik
NetworkCardPanel.usingProxy=<html>Za povezivanje s Internetom koristim posredni\u010Dki (proxy) poslu\u017Eitelj<br>(ukoliko ne znate \u0161to je to proxy, onda ga ni ne trebate).</html>
NetworkSuccessPanel.success=<h2>Umre\u017Eavanje je uspje\u0161no obavljeno\!</h2>\nTV-Browser se <b>uspje\u0161no</b> povezao s Internetom\!<br><br>\nU slijede\u0107em koraku \u0107e TV-Browser preuzeti popis svih trenutno <b>dostupnih postaja</b>.<br><br><br><br>\nKliknite na gumb <i>Slijede\u0107e</i> kako bi TV-Browser sada mogao preuzeti popis postaja.
PictureConfigPanel.allPictures=Preuzimaj slike za sve emisije
PictureConfigPanel.closing=<html><span style\="color\:red">POZOR\: </span>Slike nisu dostupne za sve kanale. Stoga to <b>nije pogre\u0161ka</b> ako kanali <b>ne prikazuju slike</b>.<br><br><br><br>\u010Cim odaberete \u017Eeljenu postavku pritisnite gumb "Slijede\u0107e" za nastavak.\n</html>
PictureConfigPanel.closingUpdate=<html><span style\="color\:red">POZOR\: </span>Slike nisu dostupne za sve kanale. Stoga to <b>nije pogre\u0161ka</b> ako postaje <b>ne prikazuju slike</b>.<br><br><br><br>\u010Cim odaberete \u017Eeljenu postavku pritisnite gumb "Slijede\u0107e" za nastavak.\n</html>
PictureConfigPanel.eveningPictures=Preuzimaj samo slike za ve\u010Dernje emisije (od 16.00 sati do pono\u0107i)
PictureConfigPanel.morningPictures=Preuzimaj samo slike za dnevne emisije (od podneva do 16.00 sati)
PictureConfigPanel.noPictures=Nemoj preuzimati slike.
PictureConfigPanel.pictureSettings=Postavke slika
PictureConfigPanel.preambel=Ovdje mo\u017Eete birati da li \u017Eelite preuzimati slike ukoliko to doti\u010Dni kanali podr\u017Eavaju.<br><br>Ova postavka <b>se odnosi samo na preuzimanje</b>. O tomu ho\u0107e li se slike prikazivati, mo\u017Ee se za svaku sastavnicu, koja mo\u017Ee prikazivati slike, postaviti posebno.<br><br>U programskoj tablici \u0107e slike standardno biti prikazivane za one emisije, koje se emitiraju izme\u0111u 18 i 23 sata.
PictureConfigPanel.preambelUpdate=Ova ina\u010Dica TV-Browsera <b>podr\u017Eava prikazivanje slika</b>. Po\u0161to s ina\u010Dicom koju ste do sada koristili to jo\u0161 nije bio slu\u010Daj, morat \u0107ete poduzeti jo\u0161 neke izmjene postavki prikaza slika.<br><br>
StatusPanel.channel=Odaberite kanale
StatusPanel.done=Gotovo
StatusPanel.network=Mre\u017Ea
StatusPanel.title=Korak {0} od {1}\: {2}
SubscribeChannelCardPanel.noChannelsSelected=Niste odabrali ni jednu postaju za preuzimanje.\nMolimo da odaberete Va\u0161e omiljene kanale i da ih premjestite u desni okvir.
SubscribeChannelCardPanel.noChannelsSelected.Title=Nema odabranih kanala
TvBrowserPictureSettingsUpdateDialog.accept=Da, ne \u017Eelim slike
TvBrowserPictureSettingsUpdateDialog.back=Natrag k postavkama
TvBrowserPictureSettingsUpdateDialog.text=<html><span style\="color\:red">POZOR\: </span>Onemogu\u0107eno je preuzimanje slika\!<br><br>Jeste li sigurni da ne \u017Eelite preuzimati slike?</html>
TvBrowserPictureSettingsUpdateDialog.warning=Upozorenje
WelcomeCardPanel.welcome=<HTML><h1>Dobrodo\u0161li u TV-Browser&nbsp;{0}\!</h1><br>Prije nego budete mogli koristiti TV-Browser mora obaviti jo\u0161 nekoliko prilagodbi.<br><br>Pritisnite gumb <i>Slijede\u0107e</i> ili pak <i>Odustani</i> ukoliko TV-Browser \u017Eelite prilagoditi bez ovog pomo\u0107nika.<br><br>\nOvaj pomo\u0107nik mo\u017Eete pokrenuti koriste\u0107i <i>Pomo\u0107 -&gt; Pokreni pomo\u0107nika postavljanja</i>.<br><br><br><br>Vi\u0161e pomo\u0107i oko Pomo\u0107nika postavljanja mo\u017Eete prona\u0107i u <a href\="http\://enwiki.tvbrowser.org/index.php/Install">priru\u010Dniku na Internetu</a>.</HTML>
